{"Verified Purchase":false,"Star Rating":4,"Username":"J. Kent","Profile":"/gp/pdp/profile/A23S443CQSS0AA","Helpful Votes":"3.0/3.0","Review":"I got one of these as a gift 8 months ago and immediately used it everyday afterward. The length is perfect to fit into a pocket, while still being full length with the cap off. Being made almost entirely of metal it has a very satisfying weight in the hands. With no clip this pen has no sharp edges to damage the other contents of my pockets, which is nice, but it rolls off tables readily. I am neutral on the appearance of this pen; while it is clearly well made, most people I hand it too don't know right away how to use it and several people have commented that it looks a bit like a suppository. While this pen always writes immediately, every once in a while it will leak a small glob of ink onto the page just when I start writing with it. As for writing quality, I have a Zebra F-701 which writes a very clean and fine line which I prefer to the space pen. For pocket use this pen is king and I highly recommend it. For office use my recommendation goes to the Zebra F-701 Retractable Ballpoint Pen."}
{"Verified Purchase":false,"Star Rating":5,"Username":"C. Thompson \"cthompson012\"","Profile":"/gp/pdp/profile/A2B3R0WVVJPKZ4","Helpful Votes":"13.0/17.0","Review":"This pen resides in my cell phone holder and has not let me down yet. It takes up very little space,is comfortable to hold, and writes on everything I've tried it on."}
{"Verified Purchase":true,"Star Rating":5,"Username":"D","Profile":"/gp/pdp/profile/A168KEHZ03AQDT","Helpful Votes":"3.0/3.0","Review":"I use it to write with. If you want to write things down, then you should get this pen okay."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Smitty of ONE","Profile":"/gp/pdp/profile/A1V6E5KDIYGQQD","Helpful Votes":"3.0/3.0","Review":"If you are looking for something unique to give a gift to for that hard to gift person, this is it. In the end it is just a 'pen', and a short one at that, but it comes in a cool case, and will write in any position. It is also very well made. I bought it for my father and liked it so much I got one for myself. Check it out."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Matthew Mcknight \"Barnacle\"","Profile":"/gp/pdp/profile/A2D0BST8MQ2MU3","Helpful Votes":"2.0/2.0","Review":"Because of our occupations my wife and I write a lot and in constant need of a great writing tool. At first I was hesitant because I thought the whole space pen thing was just some ploy. But after reading a few reviews and seeing how well made these pens were I was sold. Not to mention they are made in the good 'ol U.S.A. The form factor of the Bullet pen is very small when closed. It measures almost 4 inches like this. But you take the cap off and place it on the end and the pen is suddenly a full size pen measuring 5.5 inches. The powder coating has held up extremely well on this pen. Very nice being as to how much I use this thing! You get a lot of bang for your buck with the cartridges too! I have read that most people get between 6-9 months use out of each one. The writing from this thing is awesome. I cant tell you how smooth a line this thing puts down. Plus, I love how bold the ink is. I am a customer for life. If you are thinking about getting one just get it you will love it!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A3SIWX1V9U0BNR","Helpful Votes":"2.0/2.0","Review":"This is the fourth of these pens I've owned over the years. One was chewed up by my dog about 7 yrs ago and I ordered another which I lost, alas. When the chewed up one finally began to get so that the cap was loose and I was afraid it would get lost if I kept carrying it everywhere I bought another which was borrowed by a customs agent in Laredo and which I forgot to get back (borders make me concentrate on other things than borrowed pens) so I had to get another. Never carry other pens for at least 10 years and never have the desire for others. I write notes lying in my hammock with pen upside down or whatever. Useful, elegant in an understated way and just fine workmanship. The only thing is that the refills blob if you drop the pen on its point . . . but that happens with any pen I've ever used. I use the fine-point black refills rather than the medium that comes with the pen."}
{"Verified Purchase":false,"Star Rating":5,"Username":"G. Parson","Profile":"/gp/pdp/profile/AC2BZ5L08G4GV","Helpful Votes":"2.0/2.0","Review":"I've tried almost every pen out there, looking for the perfect one for me. Turns out that this is it - At least in my humble opinion. Others have commented extensively about key features like the write-anywhere-anytime ability, smooth-writing, solid feel, ink doesn't smear (even for lefty's like me), made in U.S., reasonably priced, etc. I wholeheartedly agree with all that. However, my favorite feature isn't mentioned much. My top reason for loving this pen is that I can (and do) carry it in my pocket always without fear of it ever leaking. There's a rubber o-ring that keeps it sealed. I frequently carry it while working in the 100+ degree summer heat and never had any issues with the pen \"exploding\" like most others will do in those circumstances."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Vladimir Gabrielescu \"Vlad\"","Profile":"/gp/pdp/profile/A2FGX2XKE003FV","Helpful Votes":"2.0/2.0","Review":"A space pen has lived in my pocket every day for about 2 years (had to get a new one from Amazon when I lost the last one). They are very tough, compact, weight almost nothing, don't leak, run for a good long time on a single refill, write upside down or on the rain. The only real downside is that people start realizing you always have a pen on you and keep on asking to borrow it, which is how I think my last one disappeared. I've owned far more expensive pens, I haven't owned better pens."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Bernie","Profile":"/gp/pdp/profile/A3E2ZUU0Y5B340","Helpful Votes":"2.0/2.0","Review":"While this is fairly priced and works well, the overall construction is not as solid as it was a couple of years ago. I would rather pay more and get the original brass barrel."}
{"Verified Purchase":true,"Star Rating":5,"Username":"MuslimahBride","Profile":"/gp/pdp/profile/A1MD76MJXYHR1T","Helpful Votes":"2.0/2.0","Review":"Simple, elegant style. When capped, it takes up minimal room in your pocket. When uncapped, you get the comfort of a larger standard-size pen. The brass looks natural--not painted on and not too yellowy. Just right. :)"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jacob","Profile":"/gp/pdp/profile/AC624PFUQ21WT","Helpful Votes":"2.0/2.0","Review":"I'm an avid collecter of fine pens, and I classify this as a fine pen--at an even finer price. I own numerous handmade pens and brand name pens, of which I have spent hundreds upon hundreds of dollars on, and this pen, while plain, writes as well, if not better, than many of the writing instruments I own. I take it to work with me on a daily basis, and it has replaced my retro 51 rollerball as my primary writing instrument. I honestly have no need to write underwater, upside down, or in extreme temperatures, but this pen does the job better than most of the fine writing utensils I own."}
{"Verified Purchase":true,"Star Rating":5,"Username":"D. Mckinzie","Profile":"/gp/pdp/profile/AVWWFK3FZDEL2","Helpful Votes":"2.0/2.0","Review":"The big thing these pens were advertised for was that they will write at any angle. I don't write upside down much. In fact, with the amount of time I spend on the computer, I don't write with a pen much at all any more, at any angle. But, it will store in your purse or pocket without taking up much room or putting ink everywhere, it's nice looking, and it writes well. I'm very pleased."}
{"Verified Purchase":false,"Star Rating":4,"Username":"RRM \"Yet Another IT Guy\"","Profile":"/gp/pdp/profile/A12VKZOPDLMJ2W","Helpful Votes":"6.0/8.0","Review":"The Fisher Bullet Space Pen is a great pen! I love the compact size which makes it easy to carry everywhere, and it writes incredibly smoothly. It is neither too fat or too thin and the ink glides over paper, even if you don't have a hard surface underneath the paper while writing. The only reason I give it a 4 out of 5 is that I ordered two and one writes with deep, dark black ink while the other looks a little faded and doesn't write as smooth. Maybe it was sitting on the shelf for longer or something but it's not quite the same as the other one. I still like it better than any other pen I've owned so no big deal."}
{"Verified Purchase":true,"Star Rating":5,"Username":"R. Bright","Profile":"/gp/pdp/profile/A1M5W3REFQD0I3","Helpful Votes":"2.0/2.0","Review":"I had a red one, which was smooth sided, loved that. This one is even better, the gold grew on me once i started using it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Zachery Williams","Profile":"/gp/pdp/profile/A1E3JOGCSOQQRG","Helpful Votes":"2.0/2.0","Review":"Fisher space pens are awesome. This one is awesome too. I like the gold and the ribbing. totally looks awesome"}
{"Verified Purchase":false,"Star Rating":5,"Username":"Scott","Profile":"/gp/pdp/profile/A1DK5UH3C3RG52","Helpful Votes":"3.0/4.0","Review":"I am very pleased with this pen's performance. It's perfect for pocket carry because it folds up into a tiny package, and it's practically indestructible, so I never have to worry about leaking ink on my pants. I purchased the black model for myself and the gold model for my dad as a gift. I prefer the look of the black model, but the golden one has ribs along the side that gives you better traction. My only complaint is that on flat surfaces, there's nothing keeping the round pen from rolling around. Long story short: Pros: + Durable + Compact + Reliable + The ink cartridges write for ages, and have an amazing shelf life Cons: - Not great for desktop work, since there's nothing keeping it from rolling away (although you can purchase a slide on pocket clip to solve this problem)"}
{"Verified Purchase":false,"Star Rating":3,"Username":"DhammaBum","Profile":"/gp/pdp/profile/A3P2RDE2TVAYQ","Helpful Votes":"3.0/4.0","Review":"I've wanted one of these pens for many years and finally decided to purchase one. And why not? It is capable of so many cool things (you know the list)! It's size is amazing, and due to its sturdy construction, it has little heft to it as well. Unfortunately, it writes pretty poorly: the ink does not flow well onto the page (I even tried various paper types), and when it does, it often clumps up and leaves smudges, or it trails little webs of viscous ink in between letters and/or words. I was really hoping that this would become a pen for my everyday carry and use, but I think I'll be returning it: I could handle function without the form, but not vice versa. If possible, I would've rated this pen's form as 5 stars, and its function as 2."}
{"Verified Purchase":false,"Star Rating":5,"Username":"David","Profile":"/gp/pdp/profile/A3VAVBLVQETI6J","Helpful Votes":"1.0/1.0","Review":"The pen compresses down to a small, unobtrusive package. I've never had a problem with it; it writes no matter what. I've written on wet paper in the field, on the palm of my hand when it's sweaty, even upside down for extended periods. My only potential qualm with it is that it compresses to perhaps too small a package (read \"easily lost\"). I've owned a few, and at least one is still out in the treeline. However, it's not enough of an issue to take away a star. In the end, it's just a pen, but it's the best I've ever owned."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Glenn E. Graham \"Glenn Earl\"","Profile":"/gp/pdp/profile/APWY5SPO12LJQ","Helpful Votes":"1.0/1.0","Review":"I have used this pen for three years. It is NOT a everyday work pen. There are more comfortable pens for long term usage. It is the perfect pen to have with you always. The pen writes under every condition. It slips into your pocket without notice, but is there every time you need to make a note or fill out a form. You never have to ever worry about finding yourself needing to write when no pen is available or when the pen you are given will not make a line without drying up half way through. Great personal pen."}
{"Verified Purchase":false,"Star Rating":5,"Username":"T. Baker","Profile":"/gp/pdp/profile/A14PI3AJ50R0HY","Helpful Votes":"1.0/1.0","Review":"I am not one to really get excited about pens. Normally just use a \"gel pen\" and don't think much about it. This pen was different though. I love that it's so small, which is why I purchased it. It's easy to put in your front pants pocket and carry with you for whenever inspiration strikes or you need to write down a list of what to pick up at the grocery. I use it a lot more than I expected to and it's been wonderful. No more forgetting the milk!"}
{"Verified Purchase":false,"Star Rating":5,"Username":"JC","Profile":"/gp/pdp/profile/A3JJFDDFQNBGV9","Helpful Votes":"1.0/1.0","Review":"I have two of these. Of all the pens I've ever used in my life, this is my favorite. Writes under water, upside down or whatever other position you need to write in. The compact size is great, it fits easily into my pocket. Most importantly to me is I never have to scribble to get the ink to write, its always ready to write no matter what. I totally recommend this pen, it will never let you down."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Brad Ward","Profile":"/gp/pdp/profile/AHDOREQL6PJSB","Helpful Votes":"1.0/1.0","Review":"That's right a gold Fisher Bullet pen. When you have a Fisher Bullet pen in your pocket when you need a pen it doesn't get any better than that. It fits nicely in your pocket or purse and always writes. I have one in my car that sits outside in the Winter. The Bullet pen writes at any temperature. I won't leave my home without my Fisher Bullet pen."}
{"Verified Purchase":true,"Star Rating":4,"Username":"C. E. Thurston \"Curt the consumer\"","Profile":"/gp/pdp/profile/A1QKB2O3TJ87A9","Helpful Votes":"1.0/1.0","Review":"I bought eight to have engraved , like mine and others I've bought in the past but these were ribbed and had no place for engraving."}
{"Verified Purchase":true,"Star Rating":5,"Username":"TCB","Profile":"/gp/pdp/profile/A2OQXITLC1C56Z","Helpful Votes":"1.0/1.0","Review":"Love how I can always have a pen with me since I rarely wear shirts with pockets, but always have a pants pocket that this pen makes it's home in."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A2NT79NEFI3Q2E","Helpful Votes":"1.0/1.0","Review":"Bought for DH for Christmas. It surprised us both that it was not a regular sized pen, lengthwise. But it works! That's what we were looking for!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"doctordoctor","Profile":"/gp/pdp/profile/A2F3DB6CJUSICJ","Helpful Votes":"1.0/1.0","Review":"There is never a time that I am without a writing tool which writes. Great little stylus. Do not lend it to anyone--you will not get it back."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Major Wood","Profile":"/gp/pdp/profile/A2UAEL50A9JKR6","Helpful Votes":"1.0/1.0","Review":"Great every day carry item. It writes well and is a solid performer in cold weather which was one of the primary reasons for the purchase. Compact when closed and fits nicely in a front pants pocket. I barely notice it when stored. I have large hands and it fits well when opened and capped for writing. The gift box was cool if you are purchasing for someone else. Buy the pen. If I ever lose it I will buy another without hesitation."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Thomas Cantey","Profile":"/gp/pdp/profile/A16KDRHJPGXG2Y","Helpful Votes":"1.0/1.0","Review":"Fits right in your pocket with no clip. Writes without fail, every time. I like the matte finish, it seems to stay in my pocket better and not go looking for a new owner. I also keep a small Mead memo book in by back pocket to jot down notes and thoughts. I just like paper, and flipping through it to see what I have and haven't done."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Larry Welty","Profile":"/gp/pdp/profile/A24YD9EQ7SHRJO","Helpful Votes":"1.0/1.0","Review":"It is THE pen. Who can resist this sexy design and the ease it drops into any pocket or purse."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Shane Hoff","Profile":"/gp/pdp/profile/AR2MUWEIMU0WI","Helpful Votes":"1.0/1.0","Review":"I have a space pen from when they were first making them from my grandma and I just recently purchased one for a great price(I love you again amazon!!)! It's small and compact, but it's just what I wanted! I was wondering if it came with a gift case and sure enough it has a plastic case with an inside that makes it look like its floating in space.. Pretty cool! Very happy and excited to give this away to my life partner for Christmas!! He will be super excited! Love that it comes in so many colors too!!! Gold pens are hard to find (especially ones that write with black ink)!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Burkey","Profile":"/gp/pdp/profile/A3GPKYZ00ISB42","Helpful Votes":"1.0/1.0","Review":"I was so pleased with this pen that I re-ordered it for a gift. As stated in the advertisement it seems to virtually write on any surface, and in any direction. Other pens would either put a hole in my pants pocket or sometimes my shirt pocket, what a nuisance. It's so durable and easy to carry around. I still have my first pen (approx 4 yrs). I use the pen absolutely every day and just put in my second refill 2 days before this post was written. It is probably the last pen you will ever have to buy (unless someone steals this from you...yeah it's that good)."}
{"Verified Purchase":true,"Star Rating":5,"Username":"QM1 Gonzo","Profile":"/gp/pdp/profile/A1KBDEWWFABQSX","Helpful Votes":"1.0/1.0","Review":"Great Pen, does everything they said it would do. I love the sleek look and feel of the pen and have had no issues with it at all."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Dan \"Dan\"","Profile":"/gp/pdp/profile/A1JJGY80GQ4H6","Helpful Votes":"1.0/1.0","Review":"I have had other Fisher Space pens and I like them a lot. This one is a bit smaller than I expected. It does list the size so that is really my bad. The overall design is nice but the cap is a little on the loose side and I am fearful that I may lose it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Derek","Profile":"/gp/pdp/profile/A39L3UN142SZAO","Helpful Votes":"1.0/1.0","Review":"Makes a great affordable gift. The Gold Lacquered Brass looks terrific and is fairly durable. Made in USA. I always keep one handy in my pocket."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Joseph C.","Profile":"/gp/pdp/profile/A4BG4JE600K2T","Helpful Votes":"1.0/1.0","Review":"Perfect Size and Writes on Every thing and Any Thing...Everyone who sees it ask what type of pen is that? A great value and feels good in the hand, heavy and solid. Great Pen that will last literally for a life time."}
{"Verified Purchase":true,"Star Rating":4,"Username":"William Robinson Jr.","Profile":"/gp/pdp/profile/A37ZRZ22VBHZQQ","Helpful Votes":"1.0/1.0","Review":"It has a very classy appearance with the grooved grip that I prefer. This is my third Fisher Space bullet pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/AH5M4CV4ECQ62","Helpful Votes":"1.0/1.0","Review":"Best pen I have ever used. Just wish i had a reason to use it for its intended use without ridicule. You tend to get funny looks when you come up with ways to write upside down or under water in an office setting. Also I have tried everything I can think of to get into space but it is more difficult to sneak onto a space ship than I was led to believe through tv shows and movies. But one day I will succeed and come back for an update on the effectiveness of this little guy in a zero gravity environment"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jason Nye","Profile":"/gp/pdp/profile/A67SZBD5JJ8WJ","Helpful Votes":"1.0/1.0","Review":"i used to have a space pen when i was younger and i loved it. this pen is no different. it writes very well and actually fits well in my hand for being so small"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Trey","Profile":"/gp/pdp/profile/A1VKA5J3NF7OU9","Helpful Votes":"1.0/1.0","Review":"I love this pen. I put a fine point refill in it, but this is the best pen I own. It's durable and looks really nice."}
{"Verified Purchase":true,"Star Rating":5,"Username":"L. Chan \"Siouxsie Homemaker\"","Profile":"/gp/pdp/profile/A1ADE00Y75VE3J","Helpful Votes":"1.0/1.0","Review":"There are several reasons why this pen is the bomb: 1. It feels heavy in your hand. Substantial. 2. When it's capped, it's very small. I can stick it in my tiniest coin wallet with no problems. 3. The cap sticks so I never worry about it falling off in my purse. 4. It's writes SO smoothly in every direction. I've used it to write upside down with no problems. 5. It looks super slick. I feel like an Asian female James Bond when I whip this bad boy out. Love it!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Joshua D. Murrah","Profile":"/gp/pdp/profile/A2QEO5YE6EK8YO","Helpful Votes":"1.0/1.0","Review":"I carry one of these daily in my pocket. These write on a lot of things that would make an ordinary pen balk, such as thermal receipt paper or a glossy looking rebate form. The length is pretty interesting, it's very short when the cap is on, but with the cap reversed (ready to write), it's the length of a normal pen, a neat trick. It's a well built pen, black-painted brass. You'll lose it before ever wearing it out or damaging the shell. The only downside I've experienced with these is that there's no clip built-in, so they'll roll away very easily. I've made it a habit to put the cap back over the head of the pen and put it back in my pocket ASAP, that also helps me keep track of it better."}
{"Verified Purchase":true,"Star Rating":5,"Username":"borego","Profile":"/gp/pdp/profile/AI1JRLJE59R5R","Helpful Votes":"1.0/1.0","Review":"The Space Pen is very smooth and sleek. If you want to carry it in you pocket then i would recommend the clip has an option. I carry this in my briefcase so i wont lose it. When you first open it up from the case it is a small pen, but after you open the pen to actually use it for written it opens to become a descent size length. Not to big or small. It writes very well which is a reason many people use this pen in other pen mods. I would recommend this pen to anyone and everyone."}
{"Verified Purchase":true,"Star Rating":5,"Username":"John Doe","Profile":"/gp/pdp/profile/A3PET8Z6F8BNK8","Helpful Votes":"1.0/1.0","Review":"There are so many things to like about this pen: its compact size, its sturdiness and quality, its amazing pressurized ink technology, the list goes on. I've been carrying this pen with me in my pocket every day since I got it and it's come in handy countless times. I was a bit skeptical about how much use I would actually get out of it, but I've found myself using it numerous times each day. It's a joy to write with; the ink flows beautifully but it doesn't bleed through even thin paper. It writes on otherwise finicky materials like plastic rather well, and you never have to scribble it to get the ink flowing. I'll never steal a pen from anyone again for as long as I own it!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"jeff.b","Profile":"/gp/pdp/profile/ARM9SVPBT218A","Helpful Votes":"1.0/1.0","Review":"This pen is perfect. I have this with me at all times and it fits snugly in my pants pocket that I never realize it's there; that is to say I am not hindered by it lying in my pocket. It writes smoothly and doesn't skip. Fits comfortably in my hand as I write."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Michael","Profile":"/gp/pdp/profile/A1BG5LYLIFXF9O","Helpful Votes":"1.0/1.0","Review":"Fits extremely well in my pocket. Love the way the pen has an etched pattern even where I hold the pen to write. That etching prevents the pen from slipping as I write! Nice! I like that it is made of brass since that metal is naturally antimicrobial (kills germs and viruses). The pressurized pen cartridge writes well. I bought this model and the one with the clip. They were both the same color and no difference other than the clip. I carry it in my pocket and I hardly notice it with my keys. Has already come in handy several times. My son prefers the one with the clip so he can store it in his backpack's pen holder."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Guitar Man","Profile":"/gp/pdp/profile/AY4YVUW0CEH8Y","Helpful Votes":"1.0/1.0","Review":"Had one of these pens I bought from the company logo store back in the 80's. It worked forever and wrote at any angle, unlike other everyday pens. It seemed to have an unlimited supply of ink for such a small pen. It got lost over the years and I was excited to see an add for one recently. Amazon had them so I bought a couple...my wife is thrilled with hers as well."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Caninphx","Profile":"/gp/pdp/profile/A2PCJUO4PEVZE5","Helpful Votes":"1.0/1.0","Review":"I tend to travel and work abroad a lot and this pen although small is truly mighty. All kidding a side, the pen writes extremely well and the ink does not smear like others do when I write in the rain in my field books(I know should be using pencil). The pen is relatively small and compact wich is great if you have limited space to carry your day to day stuff. I highly recommend getting the attachment clip for the pen if ti does not already have it. Pros: -Size for traveling -fits in a pocket easily -waterproof(ie will not fail if it gets wet unlike others) -able to write upside down, although this has no bearing on me Cons -size(I have lost two) -some may find the pen to small even with the cap on it -mine came with a black ink cartridge and medium point, I like blue and fine points which was easily fixed. Would be nice to have the option when ordering. Overall decent pen that is perfect for the traveller or expat among us who has a limited space when traveling and wants a decent pen to be able to write with."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Larry Lee White \"larrylwhite\"","Profile":"/gp/pdp/profile/ALG8ATV5YME6P","Helpful Votes":"1.0/1.0","Review":"It is a must like keys and wallet everywhere I go. Rugged, fun, stylish and compact... My Family and Friends love them for Christmas and birthday gifts!!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"S.J.","Profile":"/gp/pdp/profile/ATFFFDP1JGPSB","Helpful Votes":"1.0/1.0","Review":"Have been a fan of Bullet Space pens for some time. This one has enough texture to avoid fingerprints and to make it easy to grip. Still easy to find in a pocket. Writes smoothly, feels good in the hand. Am building a bit of a collection of of this line of pens. Thought this one might not be unusual enough to stand out, but I was wrong. This is one of the less expensive pens in the line, but one of the best values."}
{"Verified Purchase":true,"Star Rating":5,"Username":"space pen \"cprsc\"","Profile":"/gp/pdp/profile/A3P13MBP2DVALC","Helpful Votes":"1.0/1.0","Review":"I've used fisher space pens for years, this one is a beaut. They certainly do as advertised, write consist in any position. You don't have to worry about a stained pocket. The compact size fits in any pocket. It's classy, and stylish. These pens can't be beat."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Gina","Profile":"/gp/pdp/profile/A2LYRFM1FGSK3C","Helpful Votes":"1.0/1.0","Review":"nice pern. i bought it for christmas for a police officer he liked it. but i could tell it was way too small for a man i wish i got a larger one for him, but other than that it works great"}
{"Verified Purchase":false,"Star Rating":5,"Username":"deadeye","Profile":"/gp/pdp/profile/A2ENQOKGWR71WW","Helpful Votes":"1.0/1.0","Review":"Very nice writing instrument. Small size so it is unobtrusive in my pants pocket and it seems to write on anything."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Sandra","Profile":"/gp/pdp/profile/AF2V3FUU2T4FE","Helpful Votes":"1.0/1.0","Review":"Nicely boxed for gift given, writes very well and as they claim. Have purchased more as they make nice gifts for those who have everything."}
{"Verified Purchase":true,"Star Rating":5,"Username":"R. B. Ray \"Rus Ray\"","Profile":"/gp/pdp/profile/A1H6MJI466CHKL","Helpful Votes":"1.0/1.0","Review":"If you want a completely, unfailingly reliable pen that is small enough to fit in your pocket, you are looking at the correct product. I actually purchased two, this matte black one (my favorite) that I keep with me throughout the day and a silver one that stays on my bedside. I've dropped both pens countless times with absolutely no ill effect. I've thrown them in the freezer for an hour and still written with them. Through the washer and dryer, still writes. The ink dries exceptionally fast. It has a good weight. It's very small, but when uncapped and recapped on the back, it is a full length pen, so as not awkward to write with. The only thing I have a SLIGHT issue with is, as other reviewers have said, the lack of clip or something to keep the pen from rolling around when you sit it down on a flat surface. I really didn't think this would bother me until it fell off my night stand a few times. Pro: Very reliable Good weight Compact to full sized pen. Extremely durable Con: Rolls around on flat surfaces"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A5433IPUDVI16","Helpful Votes":"1.0/1.0","Review":"I always carry an ink pen in my pocket. This is the best pen for the job since it is small and doesn't leak."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Dr. Oceanfront \"Oceanfront\"","Profile":"/gp/pdp/profile/A2BYV7S1QP2YIG","Helpful Votes":"1.0/1.0","Review":"I have always loved my Space Pens as I find I like to write lying down sometimes. This pen always works no matter what. I have never had any trouble with any of these pens, except that I tend to lose them. :) My personal preference is one with a clip, but my friends love theirs without a clip because it fits easily in their front pocket. Either way, its dependable and a great little friend to have. If my review helped,you, please click on \"helpful\" below and thank you for reading my review. :)"}
{"Verified Purchase":true,"Star Rating":4,"Username":"K. Jones","Profile":"/gp/pdp/profile/A2UM9FOFJ2DEDJ","Helpful Votes":"1.0/1.0","Review":"This is my 3rd space pen. haven't worn one out yet but tend to loose them like I do everything else. Pen works as advertised and writes in any position. What I like most about it is that it fits easily in my pants pocket and is always there when I need a pen. The cap keeps trash and lint out of the tip and nicely rounded endskeep it from digging in. It's the only way I have been able to carry a pen on a consistent basis"}
{"Verified Purchase":true,"Star Rating":4,"Username":"Guy Henry Miller","Profile":"/gp/pdp/profile/A254Q7QLWX99O1","Helpful Votes":"1.0/1.0","Review":"The pen is what I expected and the order was hassle free. I bought the pen because of a recommendation from a friend."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Lucas","Profile":"/gp/pdp/profile/A3K6X5BFG4MQJS","Helpful Votes":"1.0/1.0","Review":"I love this pen. Super small. Consider the clip version as this one does tend to roll around alot and off my desk when i dont want it to."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Hoppaguy","Profile":"/gp/pdp/profile/AZAC8O310IK4E","Helpful Votes":"1.0/1.0","Review":"I have 3 of these pens because I have used every pen imaginable but in terms of portability and writing feel, this is the best pen. I carry one around with me everywhere along with a Levenger pocket brief. The pen fits perfectly in my pocket when closed. The only negative is that the removable pocket clip slides off easily sometimes but I just used a little super glue and it has never come off again."}
{"Verified Purchase":true,"Star Rating":3,"Username":"KHRHEE91","Profile":"/gp/pdp/profile/AN8KSEOEJP4Y9","Helpful Votes":"3.0/4.0","Review":"The pen is very aesthetically pleasing from the outside and the pros end at around there. It has no clip so is very hard to keep stored. Secondly, the pen feels like it's of low BIC quality as it operates and writes similarly to a cheap ball point pen. To give it some more credit, as technology for nasa it was made to write upside down and at zero gravity so it seemed like a great gift to get, but fell a bit short."}
{"Verified Purchase":true,"Star Rating":5,"Username":"L. Yann \"Garamante\"","Profile":"/gp/pdp/profile/A1OIHRRR23IL4O","Helpful Votes":"1.0/1.0","Review":"I had a lot of pencils in the past and I must say that the \"Fisher Space Pen\" is my favorite: it has an incredible ability to persist over time, a real pleasure of writing and great resistance. And that I say more ... Oh yes, it is very zen. A Must Have."}
{"Verified Purchase":false,"Star Rating":4,"Username":"T. Graves","Profile":"/gp/pdp/profile/A3D24ECY9A8VCH","Helpful Votes":"1.0/1.0","Review":"This pen is a perfect size for a pocket. A cap on the top and bottom so it doesn't poke anything. Works upside down or after having sat out in the car in sub-freezing temperatures. Expensive, but it lasts quite a while and always works."}
{"Verified Purchase":true,"Star Rating":5,"Username":"J T \"Deal Hunter\"","Profile":"/gp/pdp/profile/A1U9BRO04TB0XD","Helpful Votes":"1.0/1.0","Review":"Great Pen & makes a nice gift. I keep mine in my wallet so I don't have to use some germed up pen at the store or doctors office. Writes great on credit cards without smudging and when your signing a credit slip on a glass counter."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Lia","Profile":"/gp/pdp/profile/A58RAT6H57NPT","Helpful Votes":"3.0/4.0","Review":"This is a beautiful pen. Small, nice grip and so far I've had no issues with the pen breaking apart while flying or traveling. Update: I've had this pen for over six flights, and love it! Update: I've had this pen for over a year. Had traveled by air with this pen more than 20 times, never had a problem. I use the pen when I'm out and about. I don't use it every day. I've changed the refill twice in one year. My pen is gold color. It has kept its good lookings and color, although you can tell it's been used (something I would expect after using it for a year)."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer \"jesusfreaks18\"","Profile":"/gp/pdp/profile/A2RZ1YQ6PR5MQN","Helpful Votes":"5.0/7.0","Review":"This pen is AWESOME. VERY compact, sturdy and reliable. Goes GREAT with the moleskin notebooks!"}
{"Verified Purchase":false,"Star Rating":4,"Username":"M. Casey \"Little Milton\"","Profile":"/gp/pdp/profile/A2C425ELOMHNVW","Helpful Votes":"0.0/0.0","Review":"I could not be more pleased with this little guy despite its quirks...it always writes, it's compact, it's sleek, and the matte black finish leaves ZERO fingerprints. (You do have to occasionally have to wipe oil off of it, but that's far better than having to polish it every time you take it out.) My main problems with the pen stem from its size. It's way too damned thin for my fingers, and posting the cap on the end isn't terribly comfortable. Since it's not one piece the way full-size pens are, it never feels quite the same and is a chore to write with after about 10 minutes (at times I don't even bother posting and write with the pen stub). Those are likely the breaks with all compact pens, though, so it hardly matters overall. Sadly, 4.5 stars isn't a review option here."}
{"Verified Purchase":false,"Star Rating":5,"Username":"koiphish","Profile":"/gp/pdp/profile/A3R8M0AJT44SS4","Helpful Votes":"0.0/0.0","Review":"I just got this pen and I'm already in love with it. When closed, it is small enough to carry in my pocket as an EDC (Every Day Carry) pen and has a very small footprint. When opened and with the cap on top, it is a full length pen and comfortable to write with. Very well thought out design. It can ride upside down or sideways in my pocket and I can pull it out and write with it without having to smack it like I have to do with other pens. If you find yourself needing a pen all the time and do not want to carry a regular pen in your pocket for fear of it breaking and getting ink all over you and your gear, this is the pen to buy and carry."}
{"Verified Purchase":true,"Star Rating":5,"Username":"meh","Profile":"/gp/pdp/profile/A38E4FSBLNVC9Q","Helpful Votes":"0.0/0.0","Review":"It doesn't have the fluid feel when writing you get with a good gel pen. It will roll away...and keep rolling. It falls waaay down in my pocket and I can't find it. I don't do a lot of writing and I don't like bulky pockets. But I like to keep a pen on me and I like to know my stuff will work when I need it. This is short and thin enough that I don't notice it in my pocket. It has never failed to write. It feels good in the hand even without the cap on. I lost this one and now will be ordering 2 more with pocket clips. I did look around for something else but nothing compares in the small pen market."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Robert Fately \"f8lee\"","Profile":"/gp/pdp/profile/A1VYG5P0K83W4O","Helpful Votes":"0.0/0.0","Review":"Can't say enough good things about this pen; it's well made, and while compact enough when folded to fit into the front pocket of my jeans without poking me in the nether regions, when opened up it is essentially a full sized pen making it more comfortable to write. The \"upside down under water\" ability of the Fisher cartridge is nice as well, though I don't anticipate needing that feature set often. But this is one artifact I need to have on my person - I immediately buy a replacement on the rare occasion when I (sadly, sniff...) lose the one I have."}
{"Verified Purchase":false,"Star Rating":5,"Username":"BB","Profile":"/gp/pdp/profile/A1LUF98X6L7KCR","Helpful Votes":"0.0/0.0","Review":"I purchased this pen in 2004. It's now 2014 and I haven't yet replaced the ink. I carry the pen with me all the time on my tool belt for impromptu signatures, filling out forms, etc. I seriously can't believe the thing is still writing on the same ink cartridge. I like the thick, black, bold writing of this pen, and that it's always ready to go. No shaking, scribbling to get it started, or anything like that. Just remove the cap and start writing."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Xairip","Profile":"/gp/pdp/profile/A1XTV916JPWO6L","Helpful Votes":"0.0/0.0","Review":"These pens are amazing. I've been using one myself for a long time now, and refuse to use any other pen. My personal one is the Brass Bullet Space Pen, but as my father prefers this look of pen (he's addicted to Staples Ballpoint), I bought him this. He hasn't used it much yet, but since his OTHER pens leaked in his pocket in the wash recently, I think that will change. The only complaint I have is that the ink isn't blue, which is his favorite color of ink."}
{"Verified Purchase":true,"Star Rating":5,"Username":"K. Zhu","Profile":"/gp/pdp/profile/AHW5G853BR38X","Helpful Votes":"0.0/0.0","Review":"Love this pen! This is my fourth one! it fits neatly in my wallet, and is very convenient for the times when you just need a pen... it's a lot more than you think.. like at the DMV, on an airplane filling out customs forms, at the post office, signing a slip for delivery, writing down someone's phone number on your wrist... basically this pen has changed my life for the better... You should definitely buy one."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Stephen W Richardson","Profile":"/gp/pdp/profile/A2BQ40HOGUSORY","Helpful Votes":"1.0/1.0","Review":"Great pen. Will write anywhere on nearly everything."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Telemachus","Profile":"/gp/pdp/profile/AC2EGRJTJYVBA","Helpful Votes":"0.0/0.0","Review":"I have three of these pens and love them. I have them in matte black, chrome, and blue lacquor. They are Fisher Space Pens and very reliable. They look great! They write great! When you place the cap on end of pen, you get a full-sized barrel, so these are very comfortable in the hand. If you are prone to losing pens, this may not be the writing insturment for you. Love these pens!"}
{"Verified Purchase":true,"Star Rating":4,"Username":"scribe","Profile":"/gp/pdp/profile/A3PMF6DVKGFCN6","Helpful Votes":"0.0/0.0","Review":"Needed a pocket-sized pen to have handy. This pen fit the bill and it does a respectable job. While not the smoothest pen I've ever used, it is consistent and never fails to write when I need it to. I will admit, however, that I haven't had the opportunity to test it in space, or underwater for that matter. I did buy a second one as a backup, but haven't used it as of yet."}
{"Verified Purchase":false,"Star Rating":3,"Username":"D. Schwemin","Profile":"/gp/pdp/profile/AHA4XNFLSG7JH","Helpful Votes":"7.0/11.0","Review":"I bought both the chrome and matte black versions (with clips) a while back from my local staples. As far is it's performance goes, it does everything the package states however it leaves a bit to be desired with how it looks on paper. Just looks like your average Bic ballpoint writing on the paper. My real gripe with this pen is the clip design, and I think people should be aware of this before you make a $17 purchase here. When you do buy the versions with the clips, fisher neglected to make some sort of a recessed area in the cap so the clip could snap into place preventing it from slipping back off. So what inevitably winds up happening is, the clip keeps slipping/falling off when you go to use it (even more so with the chrome model due to the slick finish). Kind of off putting especially considering your spending $17 on the pen... Now I understand that it's got all these special features like writing upside down, underwater, etc. But it still shouldn't be at the cost of a functional and reliable pocket clip should it? I'm not trying to be overly critical here or anything, I'm just stating the obvious pitfalls. Feel free to comment on this review if you would like."}
{"Verified Purchase":true,"Star Rating":4,"Username":"G LoVecchio","Profile":"/gp/pdp/profile/A23NS8P5MC89V7","Helpful Votes":"0.0/0.0","Review":"Really does write at any angle without running out of ink! Smaller than I thought. Great for writing in bed."}
{"Verified Purchase":true,"Star Rating":4,"Username":"nfb","Profile":"/gp/pdp/profile/A1S62OHVVU9OIN","Helpful Votes":"0.0/0.0","Review":"Nice and solid feeling, could have a smoother ink though."}
{"Verified Purchase":true,"Star Rating":5,"Username":"William Odis Pate II","Profile":"/gp/pdp/profile/A2WIGR9BWATIH3","Helpful Votes":"0.0/0.0","Review":"I love these pens. They fit perfectly in one's back pocket. I've bought two (I received my first back in the early '90s from my grandfather)."}
{"Verified Purchase":true,"Star Rating":5,"Username":"JD","Profile":"/gp/pdp/profile/A1EDIK6D9A17VO","Helpful Votes":"0.0/0.0","Review":"This pen has worked wonderfully. I work in an office and would always lose my pens because other people would take them and I would never get them back. This pen has changed that. I put it in my pocket, take it out when I need it, and put it back in my pocket when I am done. It is great to have such a small and unobtrusive pen that I can carry with me everywhere."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Joshua D Johnson","Profile":"/gp/pdp/profile/A2N9P50NRHD8DP","Helpful Votes":"0.0/0.0","Review":"Fantastic pen, very compact and very useful."}
{"Verified Purchase":true,"Star Rating":5,"Username":"James F. Fordemwalt \"Firmware Engineer & Sci-...","Profile":"/gp/pdp/profile/A2CA2YPSAMEA7R","Helpful Votes":"0.0/0.0","Review":"Along with the Field Notes notebook this is a must-have for every day carry. Although small and rugged when capped, this becomes a full-sized pen when opened. It's easy to write with, and the pressurized cartridge flows evenly every time you make a mark. (If you're used to 'priming' ballpoint pens on your thumb, or a scrap of paper, you'll find yourself with little marks on your thumb because this pen marks every time.)"}
{"Verified Purchase":true,"Star Rating":3,"Username":"Pen Name","Profile":"/gp/pdp/profile/ABXDOUL2EOQUZ","Helpful Votes":"0.0/0.0","Review":"its alright. I wouldn't buy it again honestly. The packaging is nice, the pen feels nice, but the writing quality isn't anything special. It's not a smooth writing utensil. Save the money and just buy a pack of Pilot g2s."}
{"Verified Purchase":true,"Star Rating":5,"Username":"David A","Profile":"/gp/pdp/profile/A2CT8R7QFUUFZ0","Helpful Votes":"0.0/0.0","Review":"Can't beat the design or performance."}
{"Verified Purchase":true,"Star Rating":5,"Username":"IKHyland","Profile":"/gp/pdp/profile/A3I70ILK7HJ34V","Helpful Votes":"0.0/0.0","Review":"I have carried one of these around with me for years. I felt lost without it when I ended up loosing it. This is my third Fisher Bullet Space Pen over the years."}
{"Verified Purchase":true,"Star Rating":5,"Username":"warren t. bradford III","Profile":"/gp/pdp/profile/A13U90S5D84C1R","Helpful Votes":"0.0/0.0","Review":"Very smooth writing, even on skin. It fits perfectly in any pocket, and you won't even feel it there. The brass construction gives it a nice hefty feel for something so small. Very durable, and of course, it really does write upside down."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Alisa T.","Profile":"/gp/pdp/profile/A2I75M4U8HD2UP","Helpful Votes":"0.0/0.0","Review":"I purchased this pen for my brother who always looses his pen. He keeps this pen in his pocket everyday and loves it. I have to keep an extra on hand in case he misplaces the pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Ray C. Dotson","Profile":"/gp/pdp/profile/AAONRNMBWDTWR","Helpful Votes":"0.0/0.0","Review":"I give the overall design of the space pens 5 stars. It's the perfect size and shape for me, both closed for carrying around in my pocket, and opened up for writing comfort. This is the second one that I've purchased, this time for my girlfriend who was coveting mine, and my only relatively minor complaint is that the ink cartridges tend to glob up after a short time. I actually contacted Fisher customer support after this happened to the first couple of ink cartridges that I had used and they told me that it was likely that the ball or the lip holding the ball in place had been damaged somehow. After this, I found a cheaper alternative was to buy papermate refills and cut them down slightly (pushing the plug inside a bit further down first) and they write just about as well with less globbing and a pack of two was around a buck. I'm sure I'll be disappointed if I ever have to write in outer space or under water, but these work great for my needs."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Buffalo Bill","Profile":"/gp/pdp/profile/A06231392N55GF7EGNWBL","Helpful Votes":"0.0/0.0","Review":"Very handy always in my pocket writes great and bought one for a friend , i would buy it again to give as a gift .:-)"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Crazed Cook","Profile":"/gp/pdp/profile/AWDHOTKWUE3EB","Helpful Votes":"0.0/0.0","Review":"I work as an engineer and I'm always wanting a pen to sketch ideas and take notes. I have dropped it a few times and it is dented but I could really see carrying one of these everyday for the rest of my career. I used to carry a 4 color pen for doing circuit diagrams and indicating materials in sketches but surprisingly I don't miss it. I may try the color ink cartridges later but they seem a bit spendy. Also this makes a great companion to a field notebook to carry every day."}
{"Verified Purchase":true,"Star Rating":4,"Username":"logan","Profile":"/gp/pdp/profile/AGBZ7O674SYWW","Helpful Votes":"0.0/0.0","Review":"Good pen, though the finish is starting to wear. (Also didnt come with pocket clip) it is still a good buy"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Brenda Hess","Profile":"/gp/pdp/profile/A20A3BEBAVW9TV","Helpful Votes":"0.0/0.0","Review":"My son ordered one like this for himself , and decided to give the same model to a teacher as an end of the year gift. She LOVED it! And she didn't already have one! HIGHLY recommended as a different and cool teacher gift."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Monsoon","Profile":"/gp/pdp/profile/A2FUMRM2JJZKTP","Helpful Votes":"0.0/0.0","Review":"This is a pen for those who are tired of pens that run out of ink on you at the very moment you need it to work. It's also perfect for those who want something small (fits in the size of their palms) so they're not carrying so much. This pen is it. It's sleek and compact. It doesn't write as nicely as a 0.3 mm pen, but it is more reliable than any of the dozens of pens I have in my drawer. This is my go-to signature pen. The only drawback is the size can be so small that you can easily lose it. The slick texture also makes it easy to lose it from your grasp if you're not careful. Otherwise, this is a great pen that is highly reliable."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Cap'n","Profile":"/gp/pdp/profile/A18MQWHBYS6MLN","Helpful Votes":"0.0/0.0","Review":"I bought this as a pen I could keep in my pocket and count on working first try even if I hadn't used it for a while. I have carried this in my pocket for a year or so now I guess and it has never failed me... pull it out and it writes immediately first try every time. Finally... the perfect pocket pen! And the fact that it doesn't have a clip I actually really like. I carry this in my coin pocket of my jeans and without a clip I forget its there and its easy to pull out."}
{"Verified Purchase":true,"Star Rating":4,"Username":"MikeK","Profile":"/gp/pdp/profile/A3JIGWUZ5AGXL8","Helpful Votes":"0.0/0.0","Review":"I like Fischer space pens. I have always carried one in my pocket for years as a back-up at work or primary on casual days."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Joe","Profile":"/gp/pdp/profile/A3NNCJKAJ80K9T","Helpful Votes":"0.0/0.0","Review":"Small enough to fit in my pocket with my keys and it writes great! I will pickup a couple of more for gifts."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Dilli","Profile":"/gp/pdp/profile/AFZD01A9U5TBI","Helpful Votes":"0.0/0.0","Review":"These pens are very useful. I can use it for practically everything and is very useful in my line of work"}
{"Verified Purchase":true,"Star Rating":4,"Username":"M. Bach","Profile":"/gp/pdp/profile/A32XB0120YZWTO","Helpful Votes":"0.0/0.0","Review":"Hope my husband will like it. He wanted a pen to put in his pocket that would not leak, be too bulky or too long. This may fit the bill. Thinking of getting one for myself!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Louis B Baggett","Profile":"/gp/pdp/profile/A1MGNK0I4UNQ5Y","Helpful Votes":"0.0/0.0","Review":"Use this daily as a back up writing instrument. Get several as they tend to disappear or get loaned out to the less prepared."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Slavomir Zula","Profile":"/gp/pdp/profile/A38BVNWEESLSNU","Helpful Votes":"0.0/0.0","Review":"Compact and great to keep in your pocket to carry always with you. Easy to write with. I love the box and the packaging. I hope the 100 year refill shelf life claim is true although I will never be able to find out :-) Full sized with cap on. Writes great but I prefer to have the fine refill with this pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Ray D","Profile":"/gp/pdp/profile/A2NPVKOT4Y6INT","Helpful Votes":"0.0/0.0","Review":"I've carried the same black bullet space pen in my pocket for 2 years now and it's still going strong on the first ink cartridge! It has nice weight and writes on just about anything. This thing is absolutely bombproof too!"}
{"Verified Purchase":false,"Star Rating":4,"Username":"Snpntuk","Profile":"/gp/pdp/profile/A2NWKJRH34F472","Helpful Votes":"0.0/0.0","Review":"I have had several of these pens over the last 15 -20 years. The primary reason that I like the design is that when I am wearing just a tee shirt without a pocket, I can carry the pen, securely closed, in my jeans pocket where it takes up little space, is readily available, will not leak or break, nor stick into my thigh when I sit down. Now I agree that there are better pens ito use if you are writing an epistle., but in the above situation the bulletshaped space pen has no equal."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Brad","Profile":"/gp/pdp/profile/A29Y97OB0DZ6TW","Helpful Votes":"0.0/0.0","Review":"I was intrigued by the guys at Tested.com when they showed a video of Adam's everyday carry. He was carrying this small pen and extolling its virtues. He didn't let me down. These pens are GREAT. I carry one in my pocket everywhere I go."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Thomas Doeffinger","Profile":"/gp/pdp/profile/A29407GZXWL3Y0","Helpful Votes":"0.0/0.0","Review":"You won't fine a better performing pen. It works exactly as it is advertised. The rest of this text is just to reach the stupid requirement Amazon imposes on the length of a review."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Michael","Profile":"/gp/pdp/profile/A1JKBQ3BUE0MP5","Helpful Votes":"0.0/0.0","Review":"Fits great in the mini-pocket inside my jeans pocket. This pen sits in there nicely all day for whenever I may need it. Feels sturdy, writes well. What more could you want from a pen?"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Wayne E. Wooten \"hayfarmer\"","Profile":"/gp/pdp/profile/A1VAIMXOOUH4SY","Helpful Votes":"0.0/0.0","Review":"I have carried a Fisher Space Bullet Pen for many years. People often admire the pen when I use it because I can pull it right out of my pocket and have a pen that writes in almost any situation. I end up giving them away and have to replace them."}
{"Verified Purchase":true,"Star Rating":4,"Username":"GREGBUQUERQUE","Profile":"/gp/pdp/profile/A24623FF80F2JO","Helpful Votes":"0.0/0.0","Review":"With the cap on, this little thing pretty much disappears in the front pocket of 505 style jeans. Initially, you may forget you have it with you. While jotting notes in a store or somewhere, it's a good size. It almost feels like the cap will fall off, but it doesn't. I had a keychain pen from Think Geek and it fell apart after a few months and it wasn't geared towards jotting notes on the fly. This pen is much better. I'm not sure if I'll find a second use for the plastic gift box. If it's cheaper without, skip that part."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Aeppli","Profile":"/gp/pdp/profile/ABGQT6X4R5J8E","Helpful Votes":"0.0/0.0","Review":"When closed, this pen is remarkably small--approximately the length of my index finger--and fits well within the front pocket of my suit jacket. With the cap off and attached, it feels well balanced, albeit prone to roll off an uneven desk without the optional clip (I didn't purchase). My only concern is the inconsistency of of the line quality. When writing quickly, the ink is often splotchy instead of smooth and even. It works in colder temperatures and at strange angles, but not evenly, giving the appearance on paper that the pen is running out of ink. Very cool design, but I had hoped for a more professional appearance in the line quality--especially for a more expensive pen."}
{"Verified Purchase":true,"Star Rating":4,"Username":"word2ya","Profile":"/gp/pdp/profile/A317YA8BFT9BKB","Helpful Votes":"0.0/0.0","Review":"Barely an inch bigger than your tube of chapstick, this might be the king of all compact pens. Very well-designed and has a premium feel to it. Very comfortable grip, but writing comes out like your basic generic black pens you can get for a much cheaper price point. Can't recommend this pen to everyone, but for those who wishes for a compact reliable pen for everyday use, look no further."}
{"Verified Purchase":true,"Star Rating":5,"Username":"John R. Helmerson","Profile":"/gp/pdp/profile/A8GJQY9W68GGK","Helpful Votes":"0.0/0.0","Review":"While I was on the job it was necessary to always have a pen in my shirt pocket. Once retired I dressed more casually wearing sport shirts without pockets to clip a pen. The Bullet Pen fits easily in my pant's pocket and when needed it can be easily extended into a comfortable writing position. I have used these pens for many years without a failure or disappointment. The ink flows smoothly with never a blotch no matter how long it has been inactive. The Bullet Pen has been my primary pen since my retirement over twenty years ago."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Lux","Profile":"/gp/pdp/profile/A1A3X7RIQ2QEBS","Helpful Votes":"0.0/0.0","Review":"What else is there to say about one of the greatest pens there is. Great feel, great write. Buy it."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Paul R","Profile":"/gp/pdp/profile/A1EEXQ2Y9YDW5G","Helpful Votes":"0.0/0.0","Review":"For the rave reviews I find these pens a let down. Yes it writes well, but that's about it. As an EMS field supervisor I am out in all weather. A good reliable pen is a must have when on scene. The actual pen size is about the same as a mini golf pencil and it gets lost in pockets easily. It is way to small for comfortable writing in my hand. The cap does not lock onto the pen at all and can be counted on to go flying if the pen is dropped. It's a desk queen, not a field pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Traveling Man","Profile":"/gp/pdp/profile/A2FH1EGF1C5P7H","Helpful Votes":"0.0/0.0","Review":"I have a real love for the Fisher space pens. I wish I could have 20 of them because I am prone to loosing them. It would be great to have one with a key ring attachment."}
{"Verified Purchase":false,"Star Rating":2,"Username":"Colby D. May","Profile":"/gp/pdp/profile/A33JFWUZ4GLGIP","Helpful Votes":"0.0/0.0","Review":"From a looks perspective, this thing is a winner. It also writes quite well and smoothly for a ball point pen. But in both respects, there are other pens available for less money which deliver on par with this overpriced writing instrument. A short time after I started using it, the *metal* barrel developed a crack, which in turn causes the insert that carries the ink supply to gradually slip out. I super glued the insert back into place, but that was only a temporary solution. Mine also came with the pocket clip, which out of the box had a tendency to slip off the end of the pen. I had to modify it to stay in place. Finally, my pen has the stylus tip for use with touchscreen devices--the tip came loose and it too required a super glue application to keep it from getting lost permanently. I probably should have sought warranty relief (and may still), but just never got around to it, probably because I felt a replacement would be just as shoddily made. This pen might have been the bees knees years ago, but now is just a shadow of its former greatness. Save yourself some money and buy a less inexpensive and more reliable pen...a Parker Jotter comes to mind."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Loretta Pirozzi","Profile":"/gp/pdp/profile/A3FPAERU2I3OV6","Helpful Votes":"0.0/0.0","Review":"I love these bullets. They feel good in your hand and can be fondled in your pocket. It's just so sleek. And so many colors. They also make a great $20 gift. When you take off the top and put it on the other end it still feels sleek and now it's a standard length. Especially good for crossword puzzles in bed because it writes at any angle. If you've never had a Fisher Space pen, it's time to try one."}
{"Verified Purchase":true,"Star Rating":4,"Username":"james lozier","Profile":"/gp/pdp/profile/A31WASYQXWDR5T","Helpful Votes":"0.0/0.0","Review":"I keep have bought many Space Pens over the years . I love how they fit in my pocket . The reason I have had many is , because of their small size , I continue to misplace or loose them . I know I have purchased 10 or 15 over the past 10 years . Now I purchase 3 at a time. Great Product !!"}
{"Verified Purchase":true,"Star Rating":2,"Username":"Evan Colvin","Profile":"/gp/pdp/profile/A1ASL5ACEXG5AL","Helpful Votes":"0.0/0.0","Review":"I like a big, bold line when I write, and I like a pen that has some substance in my hand. While this pen has a fair amount of weight to it, it's fairly skinny, which doesn't sit well in my hand. And the ink that comes out comes out like a disposable Bic or Papermate. And yes, you can write at any angle, but the ink doesn't come out in one smooth stream. You get spots where the ink is weak, and spots where the ink is alright. I've been searching for the perfect pen--one with a good weight, a good feel, and a good line. This isn't it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"B","Profile":"/gp/pdp/profile/A3RDS0DJ5EJGA7","Helpful Votes":"0.0/0.0","Review":"...then I guess this is the pen for you. I'm thrilled to add this to my collection. It will write anywhere, anytime, in any position. If you're looking for a pocket pen that won't fail on you, this is it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Dallas Electronics Fan","Profile":"/gp/pdp/profile/A1IILFFC2EUXFC","Helpful Votes":"0.0/0.0","Review":"I've lost at least a dozen shirts to pen leaks. I bought one of these about 6 years ago (followed by a second for use as a backup) and haven't looked back. It seals well, doesn't leak and when capped, is small and doesn't jab. I've dropped them numerous times without effect. It writes on almost anything, even moist cardboard. Upside down, sideways, whatever. As they wear, the black paint wears off a little at the ends and reveals what looks like brass. Kind of nice, gives the pen a little character. It's not the most comfortable pen to use but no different than the vast majority of other pens I've used. A slightly larger version might help. Great product, happy customer."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Max David","Profile":"/gp/pdp/profile/A372FIIBLLN4FZ","Helpful Votes":"0.0/0.0","Review":"I love this pen! It is small when closed, which makes it perfect for every day carry. Then the cap attaches to the back, turning it into a comfortable, well balanced writing instrument. I can't speak to it writing upside down or underwater, but I do use it for signing up on volunteer sheets posted on a bulletin board and it has never failed to write vertically. I also used it when it was -10F outside, without any problem. As an afterthought I bought the clip attachment to carry this pen in my shirt pocket, and also to keep it from rolling off the table which it is prone to do."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Shane","Profile":"/gp/pdp/profile/AGXSG1VNU9766","Helpful Votes":"0.0/0.0","Review":"Hate looking for pens? This little beauty fits right into that little pocket jeans often have above the normal side pocket."}
{"Verified Purchase":true,"Star Rating":5,"Username":"walter isgood \"walter\"","Profile":"/gp/pdp/profile/A3KMTQOWXMVOZ","Helpful Votes":"0.0/0.0","Review":"Always having a pen in the pocket is the most useful thing ever. I can highly recommend this product. Mine has lasted over 10 years until I finally lost it on a lay-flat airline seat. I therefore immediately got a new one."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Matthew","Profile":"/gp/pdp/profile/AR2SWYB36QRR5","Helpful Votes":"0.0/0.0","Review":"This is my second one(they're easy to lose) that I've used as an EDC. I'm unlikely to use it in space or the extreme temperatures that it can perform in, but it writes really well on wet or waxy surfaces and that is wonderful. This one has a much looser cap than my previous one and I'm worried I'm going to lose it based on how easily it separates when capped."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Mari Brett","Profile":"/gp/pdp/profile/AYXKSWAAJ1696","Helpful Votes":"0.0/0.0","Review":"If you are like me and debating whether this purchase is worth it, just go ahead and bite the bullet on this one. (Pun intended) I always wanted a Fisher Space Pen and this one did not disappoint. The Matte finish is great and holds up over time. I have not had any issues with the writing and despite its small size, with the cap on the end it becomes perfect to write with!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"New User","Profile":"/gp/pdp/profile/A5N4HB8WU1H6G","Helpful Votes":"0.0/0.0","Review":"I got this because it's compact enough to fit in your pocket, the cap and case are solid enough you don't have to worry about ink spills. It sees moderate use and has been reliable. (have not tried surfaces other than paper) Every now and then the ink will start out a little blotchy but this hasn't been an issue. Would definitely purchase again."}
{"Verified Purchase":true,"Star Rating":5,"Username":"joey Wagoner","Profile":"/gp/pdp/profile/A2L7ZQ2SVB4GPG","Helpful Votes":"0.0/0.0","Review":"Great pen, writes smooth and small enough I can drop it in a pocket and forget it's there until I need it. Once you place the cap on the end to make it full size it is very solid and could be used as an impromptu weapon or self defense item."}
{"Verified Purchase":true,"Star Rating":5,"Username":"James R Childress","Profile":"/gp/pdp/profile/A3DYC5SI8P3V1C","Helpful Votes":"0.0/0.0","Review":"I love this type of pen, and all it says it can do, it has done it, and it is so easy to carry around."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Roni Filla \"Toffy\"","Profile":"/gp/pdp/profile/A2VNXWVLI7Q0L7","Helpful Votes":"0.0/0.0","Review":"I have had an Original Fisher Space Pen from back in the late 70's or early 80's...and it still writes....every time at whatever angle I might be in.... I keep it in my hand or back in my purse or a pocket for fear of someone borrowing it forever. I have had people ask to hold it...I watch them with an Eagles Eye, and take it back, for safe keeping. This pen I do not loan out...ever. I carry a spare cheapie for borrowers. It is round and it will roll off the table....duh. Try putting a rubber band on it ...that may stop it from rolling off the counter or table. I bought it to write on Frozen Meat Labels....and yes it works on that too. I used it for work and at work, and carry it in my purse. Seems to me the point of a Pen is to Write....and that is clearly what this pen does. Just exactly as described. As for the Ink color...well that is a crap shoot. Mine is blue. No Problem."}
{"Verified Purchase":true,"Star Rating":5,"Username":"J Moore","Profile":"/gp/pdp/profile/A33I6NRDH49S9M","Helpful Votes":"0.0/0.0","Review":"These are great if your job necessitates that you have something to write with and write on at all times."}
{"Verified Purchase":false,"Star Rating":5,"Username":"keeeef111","Profile":"/gp/pdp/profile/A3EWG5C5KW5W9C","Helpful Votes":"0.0/0.0","Review":"This is my 5th space pen (the 1st finally ran out of ink after ONLY 10 or 12 years, getting a new cartridge for that one, the next 3 I gave away as gifts, all still alive and well last I heard). Have there been some improvements since then? My only real gripe with the first one was you had to stroke it once or twice to get it writing if you hadn't used it in awhile, this new one wrote right away, right out of the difficult to open box. Also seems to write a little smoother (maybe? the other one was not bad really). Never have used this as a primary pen, this is something I make sure I have on me so no matter what I have a working pen, don't have to worry about it being in a hot car, submerged in water, etc. It also writes on surfaces most other pens wouldn't be able to write on, like formica tabletops at overpriced restaurants with lousy food, doesn't come off easy either. I mark alot of my stuff with this pen, like pool cues and the inside of bongo drums. Its ability to write upside down all day, in temperature extremes or underwater and its very large ink capacity just make it the best pen ever. Don't want the clip, that ruins the cool, sleek, monolithic, spacey look. And it's... BUZZ ALDRIN APPROVED! ...... Update...... Now lying flat on my back after emergency abdominal surgery and this pen is now my best friend because it can write upside down."}
{"Verified Purchase":true,"Star Rating":5,"Username":"S. Hobbs","Profile":"/gp/pdp/profile/A1R3ERCRDIAV91","Helpful Votes":"0.0/0.0","Review":"This pen was a gift. The person who received it loved it, and will continue to do so as he uses it. He loves that it writes anywhere!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jay Kenney \"James J Kenney\"","Profile":"/gp/pdp/profile/A13MM7UES60AAU","Helpful Votes":"0.0/0.0","Review":"Had one of these for years. My brother introduced me to these pens. Had to of these. Lost both of them to my \"trusted\" State of Illinois coworkers. Still working on forgiveness."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Becky J \"mom\"","Profile":"/gp/pdp/profile/A37FUV5CU0OWWM","Helpful Votes":"0.0/0.0","Review":"I wanted to gift a pen, but not just 'a pen' so this fit the bill perfectly. They loved it. It is a good size to easily carry and as versatile as advertised."}
{"Verified Purchase":true,"Star Rating":4,"Username":"visual.destini","Profile":"/gp/pdp/profile/A3G6YH6XDX64RF","Helpful Votes":"0.0/0.0","Review":"But overall great, the packaging is adorable for a gift or re-use, I purchased this as a gift. The finish is really nice but I'm a bit worried it will scratch, so I'll update if that happens. The size fits in my hand nicely and is usable- perfect for a purse- I was just expecting something more for daily use."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Thomas R. Block","Profile":"/gp/pdp/profile/A20CCQMGPL4KJM","Helpful Votes":"0.0/0.0","Review":"I like my fisher space bullet pen, having used several in the past. The only problem I have had with it is it's small size."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Patrick S. Thompson","Profile":"/gp/pdp/profile/A3UBSHXG62ORWU","Helpful Votes":"0.0/0.0","Review":"This pen fits perfectly in my naoLoop Pen Wallet and works great. Anybody that wants a great quality pen that can fit in your pocket, get this!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"jgnotary","Profile":"/gp/pdp/profile/A3DH5S621NW1CX","Helpful Votes":"0.0/0.0","Review":"It was everything I thught it would be. Great price as well. I got it for my husband as a gift, and he said it is his favorite pen to use."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Tim","Profile":"/gp/pdp/profile/A6NL9OXI8ZL4Q","Helpful Votes":"0.0/0.0","Review":"I didnt realize how small it was. Its my fault for not really doing the research but it wasnt what I was looking for. It wrote well, and took some getting use to in the hands."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Clayton A. Cohn","Profile":"/gp/pdp/profile/A1BN3DBBWLMT6V","Helpful Votes":"0.0/0.0","Review":"Fisher space pens are the best for pretty much everything. As a regular pen, they are small - I keep one in my business card case and it comes in handy every day. It's also practical because you can detach the top and attach it to the back of the pen so when you write it's as if you're writing with a normal size pen which is much more comfortable than trying to write with a short one. I often find myself writing stuff down against walls too and it drives me nuts when the ink stops flowing, so the Fisher pressurized cartridge is huge in this respect. I hear it writes under water, but I've never tried. What I do know is that for $25, you'll never need another pen again. Think it's expensive? Add up the amount you've spent on crap pens throughout your life...it might give you some perspective."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Atrevida","Profile":"/gp/pdp/profile/A3K3426UXOZBNC","Helpful Votes":"0.0/0.0","Review":"The Fisher space bullet Space Pen is always in my purse. And one on my desk. And another on the bedside. Always works It's a great gift too."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A1WG2BEOLG4E4H","Helpful Votes":"0.0/0.0","Review":"This pen rarely leaves my pocket. I have found it very useful as it stores small and I never notice I have a pen, but always have it when I need it. Like every other space pen I have used, it is reliable and writes smoothly. I can't ask for more."}
{"Verified Purchase":true,"Star Rating":5,"Username":"coach george \"Real Men Don't Coast\"","Profile":"/gp/pdp/profile/A1HPYU44KORTSR","Helpful Votes":"0.0/0.0","Review":"Great Pens, except they are easy to lose! I love these pens. They write well are comfortable to write with, write on almost anything and they look cool! My only gripe is that with out a pen clip, they are easy to lose. The small size when the top covers the point also makes it easy to misplace or forget! This is my second pen and when I lose this one (hopefully not too soon), I will buy another."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Santi","Profile":"/gp/pdp/profile/A1L548T30KON04","Helpful Votes":"0.0/0.0","Review":"I bought it as a gift but I kept it for myself since I liked it so much, nuff said"}
{"Verified Purchase":true,"Star Rating":5,"Username":"J. John","Profile":"/gp/pdp/profile/A2HNFK432FO6XB","Helpful Votes":"0.0/0.0","Review":"I received one of these as a gift from my brother a year ago, and fell in love with it. This is a great pen to keep in my pocket. It does indeed write on virtually any surface, and is incredibly smooth and comfortable to write with. It is, however, very easy to loose since it is fairly small."}
{"Verified Purchase":true,"Star Rating":5,"Username":"JAH","Profile":"/gp/pdp/profile/AGUZA2J6SN16V","Helpful Votes":"0.0/0.0","Review":"Awesome, awesome pen. You know the story: they write every time, no matter the angle, etc. Very compact when folded but perfect size when you open and put the cap on the end. This thing is always in my front pocket and I don't even know it's there. But be careful because that also means it could fall out without you realizing."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Peter Simon","Profile":"/gp/pdp/profile/AXBWHQS70E68C","Helpful Votes":"0.0/0.0","Review":"I love this pen - I like to carry a pen in my pants pocket, but hate big, bulky pens with big clips that always break off. This pen solves that issue, along with my other one - I hate super pointy or runny pens. This pen is the perfect medium between ink-heavy needle pens like UniBall and the cheap bics that require 10# of pressure to get any ink out, and it doesn't have a clip to get caught on anything."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Steven","Profile":"/gp/pdp/profile/A2FXMJD58UV7EK","Helpful Votes":"0.0/0.0","Review":"I bought this pen to carry with me so I would always have one on me for work. It's the perfect size to keep in a pocket and when uncapped it's as long as a normal pen. It always writes and is very smooth. The pen came with a medium tip, which was great, but I prefer a smaller tip, so I purchased a fine tip refill, and it was just what I was looking for. Since then, I've managed to send the pen through the washer twice and the dryer once, and, aside from a couple small dents on the end of the pen, it functions just as well as when it was new. As some people have said, the ink is not as dark as some other pens, but for me it works just fine. I would not hesitate to buy another if I lost this one, it's a great pen and well worth the money."}
{"Verified Purchase":true,"Star Rating":5,"Username":"IrishFire","Profile":"/gp/pdp/profile/A13HRSMJ5TOWEZ","Helpful Votes":"0.0/0.0","Review":"The Boyfriend loves it. He has lost his first two, so I got him three as a replacement. It's christmas every time he opens one of these! He mostly loves that the tiny form factor feels great in his small hands and in his pockets. He's grateful none of the five have ever leaked in his pockets, and thinks the \"space pen\" and features (writes upside-down, etc) are very cool. He's super-picky, so I'm glad he likes it! Your super-picky pen aficionado may also enjoy it. Good luck!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Sean G","Profile":"/gp/pdp/profile/A70JJQCQGLQT8","Helpful Votes":"0.0/0.0","Review":"space pens are cool, I love mine. Don't use these as a waiter because people steal them. Why do people steal pens...."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Marty McFly","Profile":"/gp/pdp/profile/AATMD9VCEB131","Helpful Votes":"0.0/0.0","Review":"My dad carried a Fisher \"Bullet\" Space Pen for decades. When I was in High School he gave me one for Christmas. I left it in a drawer for 15 years before I started carrying it every day. I don't think I have ever gotten a more useful gift. It takes up no pocket space and is always there so you don't have to borrow. It's fun always having a pen handy when it's time to sign for something. Once you carry one you will wonder how you did without. Aside from the convenience they write very well and are virtually indestructible."}
{"Verified Purchase":true,"Star Rating":5,"Username":"C. Schmid \"Digital Designer\"","Profile":"/gp/pdp/profile/A3LQMOBM1MR5EF","Helpful Votes":"0.0/0.0","Review":"I like this pen because there's no clip to make it bulge out in your pocket. The cap stays on tight and it writes very smooth. I would prefer a finer tip, but that's a personal preference."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Cooper","Profile":"/gp/pdp/profile/A2QZLHQK1GVZZW","Helpful Votes":"0.0/0.0","Review":"These are the most perfect pen for putting in pants pockets. Nothing to catch on and there is nothing pointed to put a hole in the pocket. The one and only downside to this pen is they slide out of pockets of suit pants, since they are loose, when you are sitting. No problems with denim jeans."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Jesse T.","Profile":"/gp/pdp/profile/A3MT6LRW0DP9XA","Helpful Votes":"0.0/0.0","Review":"The fisher pen is great, it has a solid line and great feel. It also has a nice weight to it and it never feels big in my pockets. There really isn't much to say about it other than it does feel indestructible. The line weight itself could be more fine but that is only personal preference. My one big fear about this product is that I am scared every time I sit down and it's in my pocket. The pen casing has a slightly matted finish, sleek black, and very rounded. If you include this with the small profile of the pen, it could easily slip out of your pocket if you sit at the wrong angle. It happened one time while sitting on my couch and it was lost in there for about 2 days. After that, I kept either kept it in my wallet or in my shirt pocket. I would recommend to be careful if you buy the one with no clips on them because if it's lost, that's one expensive pen to lose."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Vincent M.","Profile":"/gp/pdp/profile/A1FWZH2XUMK414","Helpful Votes":"0.0/0.0","Review":"its a pen. Nice that it would work anywhere. Has good weight, kinda of meh on the size. I wish I had bought one with the clip."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Baby_Moon","Profile":"/gp/pdp/profile/A1E6VTPY7T9VJD","Helpful Votes":"0.0/0.0","Review":"I own the chrome one and wanted something different. Comes in a gift case and I really like the black finish. The pen works great and looks like it is quite durable. The chrome one started to lose some of its finish after years of use. The black matte should provide many years of use. Just like the chrome except in a black matte finish."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Micah","Profile":"/gp/pdp/profile/AIZHW9C2VJ5PB","Helpful Votes":"0.0/0.0","Review":"it works and it fulfills its job as a pocket pen nicely. is it worth spending that much on a pen.... yes"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jake","Profile":"/gp/pdp/profile/A2ZYQCVLYBJ8WM","Helpful Votes":"0.0/0.0","Review":"This has been a great pen to just keep in my pocket. I always have a small portable pen handy and its always going to write."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Nate Mara \"Nate\"","Profile":"/gp/pdp/profile/AXJH5WYMLFKU4","Helpful Votes":"0.0/0.0","Review":"I have used this pen frequently for the past week, and I have to say: with its mix of compact portability and great writing ability, this is a great pen to carry around daily. Its metal construction means that I don't have to worry about it getting damaged/scratched in my pocket. My only concern with this pen is that the pen tip is much wider than what I usually use. I typically write with a 0.38mm Pilot G2, and the tip that is included is easily four times as thick. I contacted Fisher (the manufacturer) to see about getting a cartridge with a smaller tip, but the smallest that they make is 0.9mm. If it weren't for that, this would probably be the only pen that I carried on a daily basis, but due to the large tip size, I do have to knock it just a bit. Overall, I would highly recommend this pen to anyone looking to add to their daily carry."}
{"Verified Purchase":true,"Star Rating":5,"Username":"JaredL","Profile":"/gp/pdp/profile/AIF56B9ZSUX09","Helpful Votes":"0.0/0.0","Review":"I was very impressed with this pen and to try it out I filled up the sink and used some waterproof paper. It wrote well on it, even though some ink ran it was still very dark and legible. It has really good balance and just feels like quality. It was really short and slim and could easily go into a pocket while expanding to full size. It came gift boxed in a nice space box where the lining looked like the moon, which made it a great gift. I will definitely buy more to give to others as gifts as well."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Ron Lowenstein \"Ron\"","Profile":"/gp/pdp/profile/A2MDJL1T0F6KT4","Helpful Votes":"0.0/0.0","Review":"Best pen to carry in a pocket...writes any direction the best!! glad it was available on ebay a very good experience as I have been having a lot of trouble with other e bay vendors!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Eric","Profile":"/gp/pdp/profile/A1PCM7HI4BYVIQ","Helpful Votes":"0.0/0.0","Review":"Arrived on time and well packaged. The gift box is a great touch. What really surprised me about the pen is just how small it is when it is closed! The pen is very thin and just a little longer than a lip balm stick when closed but very comfortable to hold when opened which I was worried about because I have big hands. I can see how this could get lost extremely easily but as far as functionality and design, I couldn't be happier. Will definitely get more of these as gifts."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Frank","Profile":"/gp/pdp/profile/AV4TGMOHS726C","Helpful Votes":"0.0/0.0","Review":"I keep this in my pocket next to my pocket knife. I never have the problem of not having something to write with and it is so much easier than carrying a pen in my shirt pocket. I like it so much that I bought a bunch of them for Christmas gifts last Christmas. I've gotten loads of thanks."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Thomas M. Swartwood \"IA Title Guide\"","Profile":"/gp/pdp/profile/A3C992SVETRTMX","Helpful Votes":"0.0/0.0","Review":"These are great pens, and I love letting people write with them while explaining that they will work in zero gravity, under water and even if I am on fire (I made that last part up). Unfortunately I set a personal record for shortest time forever losing this latest pen. I will reorder, but am searchijng for a way to keep them from falling out of my pocket."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Daniel B","Profile":"/gp/pdp/profile/A36Z645SLCI8EB","Helpful Votes":"0.0/0.0","Review":"Writes smoothly and dries quickly on paper. If your in Army Aviation BEWARE: It will slide out of your sleeve pen pockets in ACU's not a problem in A2CU's but I wouldn't risk the FOD. also when writing on green tags, yellow tags, etc. the lines you write will \"break\". But if you are just looking for something that you can keep in your pocket and depend on day after day, this is the pen for you."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jim Payne","Profile":"/gp/pdp/profile/AKFDCCWOD8GNA","Helpful Votes":"0.0/0.0","Review":"I bought this pen because it was compact and I could carry it around in my pocket. I find myself reaching for it more than any other pen I have and it works every time without skipping a beat."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Christopher Young","Profile":"/gp/pdp/profile/A2NAWYW8XOVDLM","Helpful Votes":"0.0/0.0","Review":"I brought this pen for use when I am diving for abalone. I have to write on a fishing license in a small inflatable boat with every thing wet. So far this pen has lived up to my expectations. I have tried several different pens, this is the best so far."}
{"Verified Purchase":true,"Star Rating":5,"Username":"W. Garlinghouse","Profile":"/gp/pdp/profile/A2EAOFUF5QD9NL","Helpful Votes":"0.0/0.0","Review":"When closed it fits in my trouser pocket perfectly with no sharp parts to catch or snag. When open, it's nicely balanced in my hand, and writes very nicely. I lost one while hiking, and was so bummed I ordered another one immediately."}
{"Verified Purchase":true,"Star Rating":5,"Username":"jrandom","Profile":"/gp/pdp/profile/A3M2OJ1EUYS8AH","Helpful Votes":"0.0/0.0","Review":"and its a space pen! writes like a pen! stains like a pen! Perfect! Seriously is a nice little bullet pen that take Fisher refills. I like the size, closed it is under 4 inches, meaning it fits nicely in most 5th pockets."}
{"Verified Purchase":true,"Star Rating":5,"Username":"r.r.van waning","Profile":"/gp/pdp/profile/A2P9NG1PIT5W5I","Helpful Votes":"0.0/0.0","Review":"The penn lies very nice in your hand, writes smoothley, and gives the impression that it is solid. It fits perfectly in your pocket."}
{"Verified Purchase":true,"Star Rating":5,"Username":"John","Profile":"/gp/pdp/profile/A2GDNB933C1IU5","Helpful Votes":"0.0/0.0","Review":"I love how compact it is, you barely notice it in your pocket. Plus it writes good and feels good in the hand."}
{"Verified Purchase":true,"Star Rating":5,"Username":"B. Young \"B. Y.\"","Profile":"/gp/pdp/profile/A3EA80AUU9DCF7","Helpful Votes":"0.0/0.0","Review":"This thing folds up and fits in your pocket perfectly!!! I had another one before and it got fused together or something and I couldn't get it apart. This one I bought seems to be an improved design (maybe I just got a weird one on the other one) and writes perfectly. I don't like using gas station pens or a \"public\" pen to sign receipts etc and I always have this with me. I love this little thing."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Damian Patterson","Profile":"/gp/pdp/profile/A2ORGOJ9X3EID1","Helpful Votes":"0.0/0.0","Review":"Papermate pens, Bic pens, Uniball pens, none of them give me the gliding writing experience I desire and they always run dry far too quickly for me. I never have those problems with the Fisher Space Pen. I also love the way it fits in my pocket when it's closed. The only problem is when it's closed it's a little too easy to misplace it. Otherwise you can't go wrong with this pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jae Clarke","Profile":"/gp/pdp/profile/A2LFAF819T8VAD","Helpful Votes":"0.0/0.0","Review":"Writes clearly and nearly immediately (no need to scribble to get the ink flowing). Some minor smearing, but not too bad. Love the size and has been able to withstand some abuse so far. I'm pretty happy with it after a couple months' use."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Aaron Solis","Profile":"/gp/pdp/profile/ALXP4YHZLCUWB","Helpful Votes":"0.0/0.0","Review":"Fantastic pen. Love the small profile. You never even notice the pen in your pocket. Good feel in you hand."}
{"Verified Purchase":true,"Star Rating":5,"Username":"P. W.","Profile":"/gp/pdp/profile/AK5LVXBCPZH90","Helpful Votes":"0.0/0.0","Review":"The Fisher Space Pen was just what I was expecting. The pen works perfectly and the gift box was a great bonus - it was made to look like a moon scape. Really nice touch."}
{"Verified Purchase":true,"Star Rating":3,"Username":"SamPen","Profile":"/gp/pdp/profile/A3DEMKI51WFL68","Helpful Votes":"0.0/0.0","Review":"This pen is very cool and compact, but it doesn't have a snap cap it is held on by friction. so that might be a bit hard to get used to. if not pushed down good it can come lose. It should fit a pocket well, but I wish it was a little thinner. Over all I like fisher space pens and just grabbing them for my collections. especially for the price of the cheap ones. Would like one of the fancy ones though."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Rajiv Persaud","Profile":"/gp/pdp/profile/AXBJY76R82MYK","Helpful Votes":"0.0/0.0","Review":"Small, Light weight. Versatile. Great construction. Pen works well and writes on all kinds of surfaces. I would recommend it to anyone."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Alvin \"Al\"","Profile":"/gp/pdp/profile/A22Z2J9XWN64OU","Helpful Votes":"0.0/0.0","Review":"This pen comes in medium point, which I can tolerate, but don't love. Make sure you buy fine point refills if it suits you. I've heard that Office Depot has Office Depot Brand refills for Fisher Space pens that are 2 for $4 (average price for official refills are about $5 for 1). If you like gel pens, I've heard that Zebra F-701 will fit. I like the compact styling which makes it disappear in my pocket. I'm not yet used to having it on my person, so I sometimes look for other pens when I have it in my pocket! I was worried about the grip of this pen, thinking that it might slip out of my hands, but the matte finish provides enough grip."}
{"Verified Purchase":false,"Star Rating":4,"Username":"archer","Profile":"/gp/pdp/profile/A2EHH7TL0HJ7AE","Helpful Votes":"0.0/0.0","Review":"The bullet pen not only fits in the bottom of my pocket, but it never slips out - even when coins do. I prefer a red barrel so that I can easily find it if I leave it somewhere. The refill writes smoothly and evenly, but when it is about 3/4 empty, it blobs at the start of writing. Eventually that annoying problem goes away, it continues blob-free, and then runs dry. This has happened with 3 Fisher refills, purchased at different times. A reviewer describing a similar problem said he solved it by cleaning out ink that had collected at the end of the cap, but there is none in mine. PRO - Fits perfectly in pocket. Many pen and ink color choices. Feels nice in hand, like a netsuke. CONS - Costly. Cartridges blob when approaching empty."}
{"Verified Purchase":true,"Star Rating":5,"Username":"th3byrdm4n","Profile":"/gp/pdp/profile/A2PFK9QEESCO2W","Helpful Votes":"0.0/0.0","Review":"The product will roll on flat surfaces... Duh. It's my fault not the product, as the product was well described. I just thought I wanted this one, but really, it's annoying. I wish it at least had a minor impression on it somewhere to help prevent the rolling. This one was specific to not having it, so I just should have chosen better.. Also, I have run it through the clothes washer and it didn't explode, so for that alone I give it 5 stars. It's about 3\" long, if it was a little bit thinner it could probably fit in my wallet, incongnito style"}
{"Verified Purchase":true,"Star Rating":5,"Username":"ckarpyszyn","Profile":"/gp/pdp/profile/A3TMWVTSB5FA51","Helpful Votes":"0.0/0.0","Review":"I wanted a pen that would disappear into my pocket all day and get pulled out in those moments when you absolutely need to take a written note. This is a pretty damn good pen. It's smaller and slimmer than chapstick. When it is opened it has a solid feel and becomes the length of a typical pen. It's practical and comfortable. Writing quality is what you would expect from a high end ball point. The ink is a bit light but the flow is very smooth and consistent. There has not been a situation where it wouldn't write. I'm very satisfied with this purchase. It's more than just a novelty if you want to carry a pen with you all day."}
{"Verified Purchase":true,"Star Rating":5,"Username":"m.anderson","Profile":"/gp/pdp/profile/A1620I8N9WIIJY","Helpful Votes":"0.0/0.0","Review":"this pen is pretty awesome you can use it underwater upside down or even in space i recommend this to anyone with uniqe interests and want a nice pen."}
{"Verified Purchase":true,"Star Rating":4,"Username":"TruePhil","Profile":"/gp/pdp/profile/A18PGL0LTI2SG6","Helpful Votes":"0.0/0.0","Review":"Fits comfortably in my front pocket so its always handy. The ink is not very dark but adequate. I like the feel of the black matte finish."}
{"Verified Purchase":true,"Star Rating":5,"Username":"John Wickersham","Profile":"/gp/pdp/profile/A1G4XOD762RK05","Helpful Votes":"0.0/0.0","Review":"This pen fits easily within my pants' pocket, so I'm never without a pen. Great invention. I own a backup just in case I lose this one."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Shelly E. Dahl","Profile":"/gp/pdp/profile/ABFVXKM4UF7G3","Helpful Votes":"0.0/0.0","Review":"Got it for my 11 year old after seeing it on \"How's it made\". He loves it and things it's the coolest. I thought it could be a little longer, so only 4 stars."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Robert D. Matthews \"Dirk\"","Profile":"/gp/pdp/profile/A3FB7BM50ZBIZB","Helpful Votes":"0.0/0.0","Review":"small and easy to carry around - just perfect when traveling. i used one for many years until i lost it!!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"David Hall","Profile":"/gp/pdp/profile/A1QJ4LQ4YMB1DV","Helpful Votes":"0.0/0.0","Review":"This pen meets my every-day-carry (EDC) requirements: - small - useful in multiple situations - great quality - did I mention small? I'd buy it again."}
{"Verified Purchase":true,"Star Rating":5,"Username":"David A. Helfinstine Jr.","Profile":"/gp/pdp/profile/A3GUJU06109L2O","Helpful Votes":"0.0/0.0","Review":"Excellent product! No ink blobs, writes smoothly all the time. Perfect to keep in my pocket all the time. Saw it for the first time watching Adam Savage's Everyday Carry over at Tested. Highly recommend this product to anyone who wants a full size pen in a size small enough to carry with you all the time."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Li85","Profile":"/gp/pdp/profile/ARPEZ3KXLFK8K","Helpful Votes":"0.0/0.0","Review":"Title says it all, I bought it to carry everyday with my Field Notes and it has not let me down! It writes super nice and steady and is the nicest pen I have ever owned! It definetly lives up to the hype."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Rob S.","Profile":"/gp/pdp/profile/A1O7OOTOC3GZPJ","Helpful Votes":"0.0/0.0","Review":"Great pen that allowed me to write anywhere at anytime. The size and smooth shape made it very easy to carry on a daily basis in my small jeans pocket but, after about 3 weeks, it magically disappeared. I am ordering a replacement which I will be paying closer attention to..."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Drew Perry","Profile":"/gp/pdp/profile/AHNNE7YZ3AUH5","Helpful Votes":"0.0/0.0","Review":"As a lefty, I often experience the \"dry ink\" problem that righties are clueless to. On most ball-point pens, the ink is designed to be pulled from the pen as the right hand draws the ball across the paper. Lefties instead push the pen with their left hand, which doesn't allow the ink to flow smoothly and can lead to lines without a full ink level. The pressurized ink tank in the space pen completely solves that problem. Granted, I've owned other pressurized pens that work in much the same way. But capped, this pen is so small I leave it in my pocket at all times along with my little Swiss Army knife. Definitely an everyday carry."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Adrian","Profile":"/gp/pdp/profile/AN71TKRTX4PM0","Helpful Votes":"0.0/0.0","Review":"I needed a pen I could carry everyday that: - Wouldn't \"click\" open and leak ink on my pants - Doesn't have sharp edges that poke when I sit down - Writes well - Is light and compact Previously I had a Zebra F-301 Compact that I loved, but lost. http://www.amazon.com/Zebra-F-301-Compact-Ballpoint-Black/dp/B003LTOSK0 The Fisher Bullet Space Pen is better than the F-301 Compact for two reasons: - When you take the two pieces apart, and reassemble them, friction keeps them together. The two pieces of the F-301 Compact are loose when assembled as a pen, which is a bit awkward and annoying (still a great pen otherwise though) - Adam Savage carries one. [...]"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Thomas \"thomas_matthew\"","Profile":"/gp/pdp/profile/A2W3K1WNVWM1JW","Helpful Votes":"0.0/0.0","Review":"Yeah, you're probably not going to be in space anytime soon with this pen. But buy it because it's small and fits easily in pocket or purse, and it's incredibly durable. Sure it writes underwater and on almost any surface, but you'll love it because it's reliable and built like a tank."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Tyler Durden","Profile":"/gp/pdp/profile/A3P6V9K9QGZEDN","Helpful Votes":"0.0/0.0","Review":"I love this pen. I have been searching for a pen I could keep in my pocket without the awkward feeling of a pen in my pocket. This pen fits the bill. Not only does it fit seamlessly in my pocket, but when you pull off the cap and place it on the back, it becomes a full size pen. Not to mention all the other good stuff that comes along with a pressurized ink cartridge; writes upside down, writes through grease and underwater, etc."}
{"Verified Purchase":true,"Star Rating":5,"Username":"T. Murphy","Profile":"/gp/pdp/profile/A3I6UUUFMIRHAA","Helpful Votes":"0.0/0.0","Review":"I am so afraid of losing it! Without a clip it is small and handy.. but that also leads it to being easily lost. I am constantly feeling to be sure it has not slipped out of my pocket. The same exact feature... makes it both good... and bad. That said, I love the pen itself. Tom"}
{"Verified Purchase":true,"Star Rating":5,"Username":"T. S. Marsh","Profile":"/gp/pdp/profile/AHZBO08S9IMVX","Helpful Votes":"0.0/0.0","Review":"It is a pen. It is small enough that you can live with it in your pocket. It doesn't leak. It is very comfortable to write with."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Daniel Moffitt","Profile":"/gp/pdp/profile/AR786KDKWT9TM","Helpful Votes":"0.0/0.0","Review":"This pen is easy to carry in your pocket. It writes very smoothly. It also doesn't get nicked up like a silver barrel pen does."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Kallestar","Profile":"/gp/pdp/profile/AHKOAJ8BFB1UV","Helpful Votes":"0.0/0.0","Review":"This pen is awesome. It's very portable and very sleek. There are three seperate aluminum peices and the ink cartridge. The cap of the pen, when removed and attached to the backside of the pen, turns the pocket sized pen into a full sized, albeit imbalanced, full sized writing pen. The two aluminum peices of the actual pen that cover the ink cartridge are held together by a gold threading and a black rubber spacer. That is the part of the pen that I like least of all. It allows for easy access to the ink cartridge, but it has become loose after my moderate daily usage. Aside from that, it does everything I hoped it would."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Francois \"Trout Hound\"","Profile":"/gp/pdp/profile/A2BEI9QC4XQFYD","Helpful Votes":"0.0/0.0","Review":"I bought this pen to carry around in my pocket. Size-wise its perfect. As a bonus, it writes with ease. I prefer fine point, so when the ink runs out, I'll get the appropriate refill. I like this pen enough that I'll buy more of them in the coming months."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A38CZDRCC30OL","Helpful Votes":"0.0/0.0","Review":"This fits well anywhere. I use it in a fanny pack and it takes up no space but expands to fill hand for writing. So far a smooth writing implement and a good purchase."}
{"Verified Purchase":true,"Star Rating":5,"Username":"King of Hearts","Profile":"/gp/pdp/profile/A1NBUED3R777NS","Helpful Votes":"0.0/0.0","Review":"Writes very well, at nearly any angle. Very pocketable, as it's much smaller with the cap on, than when fully extended. With the way the cap is designed, this thing is completely leak-proof. Definite must-buy for anyone that enjoys a good ballpoint pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"TerranceLee Newton","Profile":"/gp/pdp/profile/A2X358ZATVBI8O","Helpful Votes":"0.0/0.0","Review":"I had one previously and lost it. I liked it so much that I had to buy a new one. It writes very well, the ink lasts forever, it writes upside down, sideways, and is smooth and grips well. You will not be dissatisfied with this pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Classic Rock","Profile":"/gp/pdp/profile/A17MMTQR9COY7D","Helpful Votes":"0.0/0.0","Review":"Purchased this as a gift for my husband - works great - smooth easy glide writing - feels comfortable in hand. Highly recommend - specially for Seinfeld fans of the \"astronaut pen\" episode."}
{"Verified Purchase":false,"Star Rating":5,"Username":"doctordoctor","Profile":"/gp/pdp/profile/A2F3DB6CJUSICJ","Helpful Votes":"0.0/0.0","Review":"Greatest little pen ever. Writes where others do not. Convenient--always in my pocket with a little cover so it doesn't accidentally spring out and ruin a shirt or other clothing."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Russell C Carter","Profile":"/gp/pdp/profile/A5VFGM287CC10","Helpful Votes":"0.0/0.0","Review":"Great pen for carrying in your pants pocket. I am a firefighter and at times wear a tee shirt, I am still able to carry this pen in my pants pocket and feel safe not having to worry about getting inked."}
{"Verified Purchase":true,"Star Rating":5,"Username":"ktdub44","Profile":"/gp/pdp/profile/A3569F1NT2KWIB","Helpful Votes":"0.0/0.0","Review":"I love this pen, it is very easy to write with and the pen is made with great materials that will stand up to the abuse of time."}
{"Verified Purchase":true,"Star Rating":5,"Username":"William M. Johnston \"Nerd2000\"","Profile":"/gp/pdp/profile/A3D1M3FNT5HGO","Helpful Votes":"0.0/0.0","Review":"I always keep a bullet shaped Space Pen in my pocket (unless I forget, like right now). Its shape is such that it fits in my front pants pocket without punching a hole in it or taking up much room. And, it always writes - no matter where. I sign things, draw things, mark things. It seems to be pretty tough. I have had probably 20 of them, losing them all. Monogramming them didn't result in any of them being returned. I always buy more than one, so I have a spare to use when I lose the first one."}
{"Verified Purchase":true,"Star Rating":5,"Username":"jpb52","Profile":"/gp/pdp/profile/A1QSOS2DY38EDO","Helpful Votes":"0.0/0.0","Review":"I've tried a number of other less expensive pocket pens, and this one is simply the best. Easy to use, stylish, and so compact I don't even notice it's in my pocket. I do prefer the matte black over the chrome. Better grip."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Emma Griffin \"ejgriffin\"","Profile":"/gp/pdp/profile/AIEDQUA2QQYDW","Helpful Votes":"0.0/0.0","Review":"I have it, my husband has it, our friends has it too! Now i just keep buying it for gifts. it writes nice and works even better. feels expensive. fits pockets nicely! what else to ask for?"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jourdon G.","Profile":"/gp/pdp/profile/A1QR4RWIC8TV1H","Helpful Votes":"0.0/0.0","Review":"Excellent size for everyday carry. Writes under extreme conditions. very comfortable to hold for long periods of writing. excellent pen for the money."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Stephen Ferguson \"steve\"","Profile":"/gp/pdp/profile/A188A7XXPFWXEC","Helpful Votes":"0.0/0.0","Review":"This pen is great to have, when a small size is important. Fits nicely in a pocket and can take a lot of physical abuse without compromising the quality of the pen. It will write on any surface I have tried it on, where others pens would not. Very dependable and great quality. It is rather pricey for a pen, but it has proven to be well worth the extra cost. I would highly recommend it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Katherine J. Barton","Profile":"/gp/pdp/profile/A2CFRCIC8S8W4K","Helpful Votes":"0.0/0.0","Review":"This is a really nice item. It's \"dressy\" without being fussy, very useful, since it writes in any position, and very reasonably priced!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Xun Gong","Profile":"/gp/pdp/profile/A2VHKI96KKCP8F","Helpful Votes":"0.0/0.0","Review":"and my friend likes it gift gift gift gift gift gift gift gift gift gift gift gift good good good"}
{"Verified Purchase":true,"Star Rating":4,"Username":"MATTyBKLYN","Profile":"/gp/pdp/profile/A29IZ7GOQD0RK4","Helpful Votes":"0.0/0.0","Review":"I was looking for a pen that could write in any position, mainly on a wall without the ink ceasing to flow. This one fit the bill. It does just that. I also like the compact size, and the rounded edges so it fits nice in the pocket. Price is good too."}
{"Verified Purchase":true,"Star Rating":5,"Username":"house of dogs","Profile":"/gp/pdp/profile/A37GAHL3KA6JF1","Helpful Votes":"0.0/0.0","Review":"The receiver of this gift loved the pen and it fits well in his pocket. Perfectly adequate gift for people who like pocket stuff"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Matt Brake","Profile":"/gp/pdp/profile/A3D7HN87R7MP4W","Helpful Votes":"0.0/0.0","Review":"Feels great on your hand and writes amazing. Ink is also very persistent when flowing through the ball point tip,"}
{"Verified Purchase":true,"Star Rating":5,"Username":"/ \"Geof Pawlicki\"","Profile":"/gp/pdp/profile/A3NPDI3K4K24II","Helpful Votes":"0.0/0.0","Review":"I've used Fisher Space Pens for over 20 years now. . . the only problem I've ever had is that every so often I lose one and have to buy another. Great product, amazingly useful to always have at hand."}
{"Verified Purchase":true,"Star Rating":5,"Username":"adam","Profile":"/gp/pdp/profile/ABW2NA00KS8NZ","Helpful Votes":"0.0/0.0","Review":"This pen is fantastic. My wife bought it on sale for me as an afterthought and I love this pen. Its compact and easy to carry, its comfortable to write with, it writes very nicely."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Steven Fornicola","Profile":"/gp/pdp/profile/A18UP5ECBXEHZI","Helpful Votes":"0.0/0.0","Review":"For those who like compact instruments that work like full size. This pen is my favorite because it's nice and small but when the cap is on it writes like a full size pen and with excellent ink flow."}
{"Verified Purchase":true,"Star Rating":5,"Username":"steffanan","Profile":"/gp/pdp/profile/A1MZYNI3LK709O","Helpful Votes":"0.0/0.0","Review":"I love my space pens, I use them all of the time. If you are trying to decide between this and another color, just keep in mind that The matte black can scrape off if you treat this pen badly, and will leave bronze colored marks. The shiny pens normally handle it better."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Clayton Rodgers","Profile":"/gp/pdp/profile/A3GU0O5A45QHO0","Helpful Votes":"0.0/0.0","Review":"Now this is a great invention. I use it all the time as it travels very well in my pocket. It is small and powerful."}
{"Verified Purchase":false,"Star Rating":4,"Username":"F. Qi","Profile":"/gp/pdp/profile/A30BC3VBPBLMWW","Helpful Votes":"0.0/0.0","Review":"I purchased this pen with the following priorities: 1) Small enough to fit conveniently into my inside coat pocket 2) Great looking pen 3) Able to write comfortably 4) Durable enough to be the only pen I will need to purchase for a few years That being said, the pen has succeeded in the size criteria. The fit is very smooth in the pocket. Some drawbacks to that design is that you will need to grip around the entire pen to be able to take it out. This is in comparison to other pens with clips where you can just take hold of the clip to extract it out. No complaint, just an observation. The feel of the pen when writing is average to sub-par. I am used to using the BiC Round Stic pens which feel like you're gliding over paper even when the pen has been sitting around for years. Coming from that experience, the writing of this pen is noticeably lacking in comparison. However, the writing is still enjoyable as an average pen and has so far suited my needs excellently and without fail. Overall, great pen with a great price. I didn't need to buy the pen for its pressurized ink, but the design won me over. I hope this review helped you in making your decision!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Juanfer Ruiz","Profile":"/gp/pdp/profile/A3PY3SLBAVLUBW","Helpful Votes":"0.0/0.0","Review":"The Space pen is awesome it is very small and you can keep it in your pocket without notice that you have it but when you need it is when it shines you open it and you get a full size pen and you can write upside down and everything else!"}
{"Verified Purchase":false,"Star Rating":5,"Username":"ATL Photo MAn","Profile":"/gp/pdp/profile/A1NFZ13T0RZDC0","Helpful Votes":"0.0/0.0","Review":"Very compact and so smooth that you forget you have it with you. I'll love this pen right up til the day I put it in a pocket with a tiny hole in it and lose it. It's the best ball point pen I've ever used and its shape and size are perfect for keeping in your front pocket. Feels like it will last a really long time."}
{"Verified Purchase":false,"Star Rating":4,"Username":"James Ridgway","Profile":"/gp/pdp/profile/A2BIJMB2BITQUM","Helpful Votes":"0.0/0.0","Review":"The bullet space pen is the epitome of useful when it comes to a pen. Pros: - the cap becomes the the 'handle' and makes this into what is essentially a full-size pen when opened. Very tricksy. - The pressurized ink is great as it will write even if the pen is upside down. - comes with a handy clip in case you want to clip it to something. - smooth roller ball makes for easy use on many surfaces. - Durable metal body ensures it will even stand up to my abuse and keep on writing. cons: - that handy clip is not permanently attached - it's fairly easy to lose. - I really prefer the fine line refill - I usually have to buy the fine point refill when I get this pen - wish they would ship it with the fine point. Overall this is a great pen - my personal 'goes everywhere with me' pen. Fits in your pants pocket and is always ready to go (unless you have a hole in your pocket....) Hope that helps...."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Lee Barnes \"Mansa Musa\"","Profile":"/gp/pdp/profile/A10NBI9QKXTUFX","Helpful Votes":"0.0/0.0","Review":"Pretty much a cool ball point pen that always writes. I bought it because I thought the concept was a cool one. It does what it is supposed to do."}
{"Verified Purchase":true,"Star Rating":5,"Username":"H","Profile":"/gp/pdp/profile/A3GVFMCF8NXIR2","Helpful Votes":"0.0/0.0","Review":"Bought this for my husband for Christmas. He wanted a nice everyday pen. This pen works great and he loves it. Going to buy one or two more in different colors."}
{"Verified Purchase":true,"Star Rating":4,"Username":"H. Heigl","Profile":"/gp/pdp/profile/A1OM19QLBAHO9D","Helpful Votes":"0.0/0.0","Review":"that is my second Spacepen bullet. It is a great pen, but you can loose it because its so small ;-) But the build quality and handling is very good. Thumbs up!"}
{"Verified Purchase":true,"Star Rating":4,"Username":"Anthony Smith","Profile":"/gp/pdp/profile/A3TOI2WTHIU54C","Helpful Votes":"0.0/0.0","Review":"Love these small pens. They will write anywhere, anytime. Very small, I always carry one in my pocket, and the ink never spills."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Mark A. Ward","Profile":"/gp/pdp/profile/A9QABX9PI0ZMK","Helpful Votes":"0.0/0.0","Review":"I bought this pen for the express purpose of writing in cold weather for a personal journal and it hasn't failed to write once. I often travel between warm deckhouse and icy exposed deck while fishing in the Bering Sea. I try to avoid waves or writing under water so I can't attest to the level of corrosion resistance or ability to function under water. Pen holds up well also during flight to a from the lower 48. It has only been a couple of weeks but the inks still going strong. Nice pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Rob Maude","Profile":"/gp/pdp/profile/A3OF3ZCRTVP4KC","Helpful Votes":"0.0/0.0","Review":"Perfect - small, lightweight, reliable and fits in my coat pocket. I bought this to keep in my jacket pocket as it's not bulky and I don't even know it's there..."}
{"Verified Purchase":true,"Star Rating":5,"Username":"ELB \"u2pilot\"","Profile":"/gp/pdp/profile/AJ6JPUCV8A9JL","Helpful Votes":"0.0/0.0","Review":"This is a great pen to just carry along anywhere. Small, compact and works as advertised. I own two and carry them everywhere."}
{"Verified Purchase":true,"Star Rating":5,"Username":"NCGodwins","Profile":"/gp/pdp/profile/A4TEKVLN99U8N","Helpful Votes":"0.0/0.0","Review":"Writes upside down and fits easily in my pocket. Only complaint is how easily I misplace it. But that is my fault. I will definitely order a new one."}
{"Verified Purchase":false,"Star Rating":4,"Username":"Robert K.","Profile":"/gp/pdp/profile/A1MIWJLN9AL7YJ","Helpful Votes":"0.0/0.0","Review":"I was looking for a pen that would make me feel manly as I wrote. This pen does not cut it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"SwissArmy Zippo","Profile":"/gp/pdp/profile/A1YYBP7N57F1IR","Helpful Votes":"0.0/0.0","Review":"This is not my first and probably not my last fisher space pen. They are excellent, write in any condition, and fit great in my maxpedition micro wallet."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Flint McDart","Profile":"/gp/pdp/profile/A3IO5O9GSQNAEN","Helpful Votes":"0.0/0.0","Review":"I've had my eyes on this style of pen for as long as I can remember, but never took the time or the money I would need to buy one. As an Eagle Scout and someone who likes to invest in durable, quality tools, this certainly qualifies. After reading various reviews on Amazon comparing the different kinds of Fisher Space pens, I feel confident that I made the right choice. It's very short and slim when compacted and is not much longer than a tube of chapstick- maybe an inch longer. Extended (the cap is placed on the back to make it pen-sized) it looks like an ordinary pen and writes like a champ. I've been using it for a week or two now, and it hasn't failed me yet. People love to use it when signing documents and I do as well. Pros: Very compact Not Shiny Writes Well Cons: Rolls off of surfaces if they are unlevel Not the length of most pens, so slots for pens don't work very well. Dropped once, very small dent on the end. In the end, you won't regret your purchase of this pen. Lets see how long the ink lasts."}
{"Verified Purchase":true,"Star Rating":5,"Username":"MissTatajana","Profile":"/gp/pdp/profile/A3E4R7Y8KBGUCH","Helpful Votes":"0.0/0.0","Review":"First thing I did when I received the pen was to see if it did most of the things it says it does. After trying most of them and the pen still working I am sure it does everything and maybe more. I also love the heaviness of the pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"ALB \"Film Geek\"","Profile":"/gp/pdp/profile/A3GQF4ARHPSU7G","Helpful Votes":"0.0/0.0","Review":"I live by these pens and always have them on me. They're comfortable, they write beautifully and fit right in the coin pocket of your jeans. The best pen for me."}
{"Verified Purchase":true,"Star Rating":5,"Username":"E. Kimball","Profile":"/gp/pdp/profile/A3MAPPKPV5MHAL","Helpful Votes":"0.0/0.0","Review":"Fits perfectly in my pocket and has an incredible ability to write upside down and under water if only I could find underwater paper too. ;)"}
{"Verified Purchase":false,"Star Rating":4,"Username":"BAM","Profile":"/gp/pdp/profile/AD0SUVSC9VQ2G","Helpful Votes":"0.0/0.0","Review":"This Fisher space pen does exactly what it's supposed to do, without compromise. There is only one suggestion I could make to Fisher engineers, however: I would be a much happier customer if the cap would fit on the shaft a bit tighter. As it is right now, the cap comes off too easily, in my opinion. Other than that, I enjoy the convenience and compactness of this wonderful writing utensil."}
{"Verified Purchase":true,"Star Rating":5,"Username":"iwalton3","Profile":"/gp/pdp/profile/A3VKH3WKCXPDCJ","Helpful Votes":"0.0/0.0","Review":"I bought this pen a while ago and after a few months of heavy use, I can say this is the best pen I have ever used. I am still on my first refill and I have wrote pages of notes with it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Robert Baisley","Profile":"/gp/pdp/profile/A75PUTEZ2KS1I","Helpful Votes":"0.0/0.0","Review":"Since I frequently wear shirts with no pockets; and since I like to always have a pen with me, I like the size of this one (short), that I can carry comfortably in my pants pocket. Also, it's just a very good ballpoint."}
{"Verified Purchase":true,"Star Rating":5,"Username":"SGCaper","Profile":"/gp/pdp/profile/A2DQTVYKR9XU8D","Helpful Votes":"0.0/0.0","Review":"This is a great pen. It really does write in any weather. The compact size is especially nice as it is unobtrusive in my pocket or my EDC pouch. Light and reliable."}
{"Verified Purchase":false,"Star Rating":5,"Username":"R Brown","Profile":"/gp/pdp/profile/A21YRGD6K1TK79","Helpful Votes":"0.0/0.0","Review":"Short and sweet I carry this pen with me every day and it has only let me down when I ran out of ink (not the pens fault). I love the small form factor, it is extremely durable, and I think that it is just cool. Why I chose this pen My first experience with all-weather pens was with the mechanical Rite in the Rain products while I was in the military (I'm getting to the Fisher). I found them to be fairly dependable and quite sturdy. The ink cartridge performed well in every aspect that I needed: wet conditions, upside down, altitude changes, high heat environments. I did not however like the full length size or that the mechanical portion became fouled with dust and debris on several occasions which resulted in a failure to operate. I was ready for a change but I wanted to keep the great performance of the ink cartridge. That's when I made the switch. My experience The Fisher Space Bullet Pen has been subjected to the same environmental conditions as the Rite in the Rain pen but it has not failed in any aspect. The pen is very simple and it transforms from its compact package to a full sized pen. Nearly four years of use and abuse has passed and with the exception of running out of ink from time to time I have not incurred a single failure. In fact, I like it so much that it has become one of my go to appreciation gifts. The pen has a hefty feel to it weighing in at 0.7oz (21g) and is balanced slightly tip heavy. The pen is milled brass so no worries about corrosion. The only thing that I feel could make this better is if there was some sort of knurling (which it looks like may have been added by looking at the pictures) on the tip to provide a better grip if you have wet or greasy hands. I have however found that if this happens you can just remove the back of the pen and use the palm of your hand to prevent slipping. As an added bonus, if you do not find yourself writing in extreme circumstances you can refill the pen with cartridges from the Zebra F-301 rather than the more expensive Fisher refills. Pros -Small size -Will write in almost any condition -Solid construction: You will not crack this pen body and leak ink all over your pocket -Easy to refill: Accepts Fisher, Rite in the Rain, and Zebra F301 refills (possibly more) Cons -Not a pen to lose due to price -Slippery with greasy or wet hands In closing Dependable, small, or unique: If any of those words describe what you are looking for I would strongly recommend this pen. If I lost this one I would definitely buy it again. I rate the product five stars because to me this is a top tear writing product because of its dependability in any weather and any environment. If you have any questions about this product, leave a comment and I will answer you to the best of my knowledge."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Brendan","Profile":"/gp/pdp/profile/A1E8Z1KSAJ6L0D","Helpful Votes":"0.0/0.0","Review":"I love these pens because of they're compactness. When this pen is caped it fits in your pocket very comfortably and you never have to worry about it bleeding. When I need it its there. I keep it with my car keys and it never get lost."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Cesar","Profile":"/gp/pdp/profile/A3JS7EJM08HV0N","Helpful Votes":"0.0/0.0","Review":"I love this pen. It writes well enough, it is sturdy, and best of all it fits in any of my pants and is ready to go when I am in need of it. I probably won't be using it for the extreme conditions it can supposedly sustain, but if I do encounter that scenario. I will be happy to share my findings."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Nathan A","Profile":"/gp/pdp/profile/A2DPKSCKAOVB6D","Helpful Votes":"0.0/0.0","Review":"Wonderful pen really writes well But it was stolen from me within the first 3 weeks of getting it :("}
{"Verified Purchase":true,"Star Rating":5,"Username":"buyer","Profile":"/gp/pdp/profile/AWCD28A3IO0CQ","Helpful Votes":"0.0/0.0","Review":"i got this a while ago and it still works fantastically. i always keep it in my pocket and the metal case is very strong. i would recommend this to anyone who wants a great pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"travisty","Profile":"/gp/pdp/profile/A2N6MS2FNKU5PS","Helpful Votes":"0.0/0.0","Review":"this is an awesome pen. i have always wanted one (for some reason, i like pens) and i usually use the higher end Parker's and Zebras, (nothing super pricey) though i have had a $300 pen that was left and never claimed at my work (i work at a bank) which i actually didnt like as much as even the others. But to the point... this has been my favorite so far, not only in ink and writing smoothnes, but in the weight and size it is just perfect. i got the matte black one, and it just looks awesome! I dont use it to write in any extreme conditions or anything, just general stuff, and it does awesome in everyday use."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Wes","Profile":"/gp/pdp/profile/A2XV5KNWU12HV0","Helpful Votes":"0.0/0.0","Review":"I love this pen. I can carry it around in my pocket comfortably and it always works. I should probably get a couple more for my desk and truck."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Timmah Timmah Timmah \"TIMMAH\"","Profile":"/gp/pdp/profile/A39FMAH8GFH9ZX","Helpful Votes":"0.0/0.0","Review":"This is a great pen. Short and stubby, but feels very solid. Heavy for its size. I imagine due to the pressurized ink catridge inside. Works like it says. Writes like a normal ball-point at any angle. Cool and could come in handy in some situations. I recommend it for anyone that needs a reliable field pen.... also - nerds, space geeks, tech dorks, tactical/military/space geeks, etc..."}
{"Verified Purchase":true,"Star Rating":4,"Username":"bochen7e7 \"Bo Chen\"","Profile":"/gp/pdp/profile/AXPFSDEPPUCUJ","Helpful Votes":"0.0/0.0","Review":"If you are looking for a quality pen that fits into your pocket nicely and doesn't get in the way, this is it. It is very compact and doesn't get in the way. Most pens are annoying and when you keep them in your pocket too long they start leaking ink.... this pen will never do that. Having said that, the \"space pen\" thing is a gimmick. There are plenty of other pressurized pens these days... many of which are just as good if not functionally better than the fisher space pen. Saying that it is \"waterproof\" and can \"write in grease\" or \"across all surface\" even in \"zero-gravity\" is rhetorical meaninglessness. Any pressurized pen can do the same thing. Being able to write upside down or in zero-g is no big deal at all. But if compactness is what you are looking for, this pen fits the bill."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Diagoras \"The Melian\"","Profile":"/gp/pdp/profile/A2HW54GEPTFB5N","Helpful Votes":"0.0/0.0","Review":"It is the third spacepen I buy. It is extremely confortable so that I take with me everywhere; and that is the problem: it easy to lose."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Droid X2 Fan","Profile":"/gp/pdp/profile/A3T1FEM8ZCSIV3","Helpful Votes":"0.0/0.0","Review":"This is the second space pen i have ever bought. The first one has lasted about ten years. still works great but i dented it several times and just wanted a new looking one. They are a great pen and they write very smooth. I do wish they had a clip on them because i usually end up digging around in my pocket looking for it and it doesn't work the greatest with the pen holders in my portfolio. I recommend these to everyone. Its also fun to tell people my pen can write anything!"}
{"Verified Purchase":true,"Star Rating":4,"Username":"A. Reiff","Profile":"/gp/pdp/profile/AK3ORMUJI69WP","Helpful Votes":"0.0/0.0","Review":"I bought this pen thinking it could be replacement for the Pilot G2 I always use. It doesn't write nearly as smooth or easily, however, no other ball point pen would either. I probably writes better than the average ball point. Its a great pen to carry in your pocket for any time you would need to write something down quick, but I would not recommend it for long term writing. I really like the shape and \"smallness\" of it, and the sleek look. Its kind of fun to be able to say your pen writes in space! I used this at school and of course, two weeks after I got I left it a desk and someone stole it. I'm sure they don't even know its a Fisher space pen or know what they are. Anyways, I would recommend this pen, but not as a replacement for a G2 or similar. Its a really great tool and probably impossible to break (but not to have stolen)."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Andrew","Profile":"/gp/pdp/profile/A23J6LXZDJ8E40","Helpful Votes":"0.0/0.0","Review":"This pen is awesome! It is small and compact and looks amazing. It writes very smoothly and is made of good quality material. I have had it for a couple weeks and have had no problems. It arrived at the earliest time said and came exactly as described in the original space pen case. I highly recommend this pen, seems nearly indestructible and incredibly versatile. You can write anywhere with it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Zee","Profile":"/gp/pdp/profile/A2SN9A7M2IM7FA","Helpful Votes":"0.0/0.0","Review":"This pen is amazing, it writes on any surface I've needed it on. I work at a concrete lab and this is the only pen I use, I used to worry about damaging the pen when using it to write on concrete cylinders (I've broken a couple before) but months later this one's still going. Finally needed to order additional ink for this so I thought I'd come back and write a review."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Marty R.","Profile":"/gp/pdp/profile/A24P30S4GEKLKZ","Helpful Votes":"0.0/0.0","Review":"I bought this pen for myself at work, I work in an assisted living facility for senior citizens. I bounce between working as a caregiver and as a med-tech both on and off the floor, I find that this pen works wonderfully for me. As a caregiver working with my residents, I daily have to mark various charts in the residents rooms , many of which are hanging on the wall, while it is a small step, not having to pull the chart down, or wait a few moments for a normal pen to re-wet the ball at the tip, with the Fisher, it is all good to go! Saves me precious moments which, believe you me, add up later. Now, when I'm working as a med-tech, pouring meds and signing my the binder we have confirming we did so for each medication. It makes a difference that it writes at any angle, as the positioning of the med-cart, relative to the MAR I'm signing, and me myself, kinda sets me up at odd angles. This pen delivers. For a final thought; this pen well balanced and easy to write with once you've put the cap on the backside of it. I like that it lasts for a long time, it makes a difference when you don't have to refill it as often. This pen also rests comfortably in my pocket when I clip it there, and the cap stays on quite well I must say. The only negative I can think of is that it is quite small and some might think it is a little hefty, but if you place the cap on the backside of the pen when your writing with it, it feels normal and natural. All in all, a great pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"krissylee","Profile":"/gp/pdp/profile/AV57KU0RN34P9","Helpful Votes":"0.0/0.0","Review":"My boyfriend wanted a matte black space pen for the longest time so I finally ordered this one for him. It came quickly and in great shape. It works perfectly and looks super cool in the matte black. I would recommend for the space pen fan."}
{"Verified Purchase":true,"Star Rating":5,"Username":"FRISCO","Profile":"/gp/pdp/profile/A1IBFW2RHNM9BK","Helpful Votes":"0.0/0.0","Review":"Pen is everything as advertised but there is one flaw. I have owned three and my only dislike is the clip, it does not stay on, slips off easily."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Dennis Stark","Profile":"/gp/pdp/profile/A30XJ7QUNXCXYW","Helpful Votes":"0.0/0.0","Review":"I bought this for a gift, and was impressed with it so much that I bought one for myself. Great price and great gift"}
{"Verified Purchase":true,"Star Rating":5,"Username":"MHM","Profile":"/gp/pdp/profile/A1HSBUUVM0DIZK","Helpful Votes":"0.0/0.0","Review":"The pen comes in a neat case that looks like a moonscape. The pen, itself, is very compact, (\"3/3/4 in) but ends up as a \"5 1/4 in full size pen. This pen will write.....period! No matter the circumstances. I left one of these, along with my Mont Blanc in my car overnight. It dropped to 20 degrees below zero (I live in upstate NY). To make a long story short. My Mont Blanc was frozen, wouldn't write, and when it did it just globed. The space pen wrote right from the git go, and never skipped a beat. Two things to remember about the Fisher Space Pens: 1) They will always write....no matter what 2) Fisher is an American company. These pens are made by workers here in the USA, and we need to support that!!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A39O67WIS7DHPM","Helpful Votes":"0.0/0.0","Review":"I needed a pen I could carry in my jeans pocket without it leaking, breaking or punching a hole in my leg. The Fisher fits the bill perfectly. The size when closed is so compact I don't even feel it in my pocket. The lid has never come off accidently, and I'm pretty sure it will never break. Writing quality is good. I haven't had any problems with runs or smears, although the line is a little wider than I was used too. I just write a little bit bigger now. All in all I've been thoroughly impressed and will be buying another or two."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Amazon Customer \"Kaye Lane\"","Profile":"/gp/pdp/profile/A3IH60N0KKTEIH","Helpful Votes":"0.0/0.0","Review":"I bought this pen for my dad, he had one that got lost earlier this year. When I gave it to him we got to play with it... It really does write upside down, sideways, and in extreme temperatures. We didn't get to test it underwater, but I bet it works even then!"}
{"Verified Purchase":false,"Star Rating":4,"Username":"$KMoney$","Profile":"/gp/pdp/profile/A20OM2K7WSAJ5E","Helpful Votes":"0.0/0.0","Review":"This is a good pen, just got it last night and already used it for notes. It writes well and smooth. I was shocked at how truly small and narrow in diameter the pen is. Thankfully, when you pull the cap off and put it on the other end to write, it is the length of a normal pen... otherwise, it would be more like a stylus than a pen. But overall, I love it. I ride my bicycle, take the bus and train to get around... this is a really tough, small pen. It looks good and writes good... and it's great for someone on the run, who still wants to have a stylish pen when needed. I'm always writing stuff, on anything I can find, napkins, wrappers... last night I wrote on a foil fruit loop wrapper... and it wrote. I think this is going to be my new favorite pen... functional, mobile and classy."}
{"Verified Purchase":false,"Star Rating":5,"Username":"M. Lorentz","Profile":"/gp/pdp/profile/AQ9M1RIQI942F","Helpful Votes":"0.0/0.0","Review":"I was looking for a pen that was small in my pocket, and nice-looking but not flashy. The Fisher Space Pen fits the bill wonderfully. It is not an absolute dream to write with, but definitely better than standard ball-point pens. It is also not particularly comfortable when writing for long periods of time, but I'm not putting out any literature with this thing, only jotting things down here and there. I love the size, the look, and consistency though."}
{"Verified Purchase":true,"Star Rating":5,"Username":"SpaceCowboy","Profile":"/gp/pdp/profile/A2TLUJJ6EYP2Y5","Helpful Votes":"0.0/0.0","Review":"I received the Space Pen earlier this week and have to say I am impressed. The shipping was fast which is always a good thing, and the price was right at ~$15 (I used the free amazon shipping for orders >$25). The pen is very compact when closed. When opened and the cap is put on the end it has a nice weight and balance. It feels good in the hand and seems very solid. The matte black color looks nice and feels nice too. When writing, the pen starts just a bit scratchy, but becomes smooth quickly. It wrote well at all angles on a few different materials like cardboard and foam. I got this pen to use as my EDC and I am very happy with it so far. Would definitely recommend."}
{"Verified Purchase":false,"Star Rating":5,"Username":"C","Profile":"/gp/pdp/profile/A2B115YIQJVYXV","Helpful Votes":"0.0/0.0","Review":"Purchased in November 2008. Small enough to fit into any pocket, like the 5th pocket in jeans. Small enough to easily lose too. I've had three of these bullet pens. The first two were Chrome plated promotional gifts which came with a slip on clip that always came off causing me to lose the pens. I like the matte black which wears away when the pen gets scratched somewhat like a camera or lens that goes through \"brassing\" over time. I wish they made this pen with a fused clip on one end, then it would be perfect. I dropped the pen with the cap on the end, and it was jammed on so tightly I couldn't remove it for months leaving the ink tip exposed. Eventually I was able to remove it with pliers. The best part of it is the ink didn't dry up and I haven't needed a refill yet!"}
{"Verified Purchase":false,"Star Rating":5,"Username":"Neil","Profile":"/gp/pdp/profile/A3IRRD5H97XOME","Helpful Votes":"0.0/0.0","Review":"This is the best pen I've ever had. It is extremely reliable, writes at any angle and is extremely easy to keep in any pocket."}
{"Verified Purchase":true,"Star Rating":4,"Username":"John Tomlinson","Profile":"/gp/pdp/profile/AC9IU76Z1PBH3","Helpful Votes":"0.0/0.0","Review":"This pen is so cool! Perfect pen to throw in your pocket and carry every day. Very tiny when closed and normal pen size when you flip the cap to write. The only reason I didn't give it 5 stars is because it's not really the smoothest to write with. Feels basically like a regular cheap Bic ballpoint.. gets the job done but isn't anything fancy."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Raptor4","Profile":"/gp/pdp/profile/A1SMAGCLH4NAXH","Helpful Votes":"0.0/0.0","Review":"Exactly what I needed, This pen fits perfectly in my EDC kit. The pen is built very well and wrights great. I needed something compact and this fits the bill. I looked at a lot of different pens because I needed something. You know the the old adage you get what you pay for. I would recommend this item to anyone in need of a compact pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Loren Estes","Profile":"/gp/pdp/profile/A36RHJ7071R1U4","Helpful Votes":"1.0/1.0","Review":"Got to have if you need a pen for the field."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Jeremy M.","Profile":"/gp/pdp/profile/A22EPPALM93HH","Helpful Votes":"2.0/3.0","Review":"I received this pen for Christmas and love it! The ink quality and flow are very good. The compact form factor is just right for my hipster PDA. The pen feels good in my hand and very solid. The stylus is a nice addition."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A6C8MMBFJQ628","Helpful Votes":"0.0/0.0","Review":"Had to have this after watching Seinfeld episode. Very nifty, small, solid feeling, easy to write with, great for anyone needing a pen to carry around for note taking. Only complaint is that it doesn't have a hook for your shirt pocket, I guess they assume you have a pocket protector?"}
{"Verified Purchase":true,"Star Rating":4,"Username":"simon","Profile":"/gp/pdp/profile/AEE3FPYU9HIT","Helpful Votes":"0.0/0.0","Review":"Great pen. A few points of improvement: 1. Cant write in all angles, 40 degrees is about the furthest you can push it. 2. I tested all my ball point pens and they all write under water. 3. A bit too small. 4. If you put the cap on the back of the pen, it gets stuck."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Noah Schmitz","Profile":"/gp/pdp/profile/APYHJS6THB296","Helpful Votes":"0.0/0.0","Review":"Elegant. Functional. Writes in space. What more could you want? Well a clip. Which would be 5 stars. They sell one for a few bucks more with a clip. Without a clip it gets lost in my pocket, and rolls off all surfaces. Still overall awesome."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jeffrey_in_NYC","Profile":"/gp/pdp/profile/A280HHBR92XUI0","Helpful Votes":"0.0/0.0","Review":"Love this pen. Smaller than I thought, but i writes at any angle (as I lay on the floor reading and writing on papers)... so it's exactly what I need. Every other pen will run dry when you try to write at odd angles, not this one. Space pen = 100% love it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Dub-Ya","Profile":"/gp/pdp/profile/AQ4PYI41D3WF1","Helpful Votes":"0.0/0.0","Review":"This has now become my everyday carry pen, it fits nicely in my pocket and disappears among my keys. Then when I need it I can find it and write the first time, every time. No need to scribble to get the ink going this will always produce ink!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"joel","Profile":"/gp/pdp/profile/A2PIKO6CGVD694","Helpful Votes":"0.0/0.0","Review":"My first fisher bullet space pen was over 10 years ago. I have used one since then. Must have misplaced my last one. that required ordering a new one. They just do the job very effectively and are so convenient to carry."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Steve Sokol \"lonesome traveler\"","Profile":"/gp/pdp/profile/AST7PP1NQDFMP","Helpful Votes":"0.0/0.0","Review":"I fell in love with this pen this first time I used it. Fits in my pocket without any worry about ink stain or breakage. I have owned several - they seem to disappear in meetings. It actually will write on anything."}
{"Verified Purchase":false,"Star Rating":4,"Username":"Ty Moore","Profile":"/gp/pdp/profile/A2ERJXX7C6EZBO","Helpful Votes":"0.0/0.0","Review":"Didn't come with the pen holder. (Though in its defense, it didn't say that it came with the holder.) I rate the pen 5 stars and subtract one star because this pen should never be sold without a holder."}
{"Verified Purchase":false,"Star Rating":5,"Username":"CharlesWells","Profile":"/gp/pdp/profile/A270UG4XNGS49L","Helpful Votes":"0.0/0.0","Review":"What can you say that's not well known in their advertising already? Guess I'll just have to carry this to space to see if it works there. Great combination is this pen and some waterproof notepad!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"B. Garrett","Profile":"/gp/pdp/profile/A2N6D3CI3AXW9S","Helpful Votes":"0.0/0.0","Review":"Love how compact it is. Writes well. Rugged. The only downside is that it rolls away. With no clip or flat side, it makes a good tool to tell you which leg of the table is short."}
{"Verified Purchase":false,"Star Rating":5,"Username":"C. Yost","Profile":"/gp/pdp/profile/ABDFB5WZ5MYCR","Helpful Votes":"0.0/0.0","Review":"This pen writes well (and upside down, horizontal, etc.) and is small enough to carry in my pocket without being bulky. My only complaint is my friends keep stealing it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Autumn Eustis","Profile":"/gp/pdp/profile/A1RRC9UVV2CO86","Helpful Votes":"0.0/0.0","Review":"This is my dad's favorite pen. I gave it to him for Christmas a few years back and it has yet to ever fail him (even after running through the washing machine by accident)"}
{"Verified Purchase":true,"Star Rating":5,"Username":"theflipguy","Profile":"/gp/pdp/profile/A3VU9S98HDEAFU","Helpful Votes":"0.0/0.0","Review":"Great pen, and I love it, but I wish I had purchased this pen WITH the clip. My bad, but still a fantastic pen. I would buy it again in a heartbeat, only with a clip !"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Hunter","Profile":"/gp/pdp/profile/A24ZLHUQS46UGG","Helpful Votes":"0.0/0.0","Review":"Compact, easy to use, and it writes everywhere! I could not find a single downside to the pen except for the fact that I'll lose it and just end up buying another one."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Bibliotek","Profile":"/gp/pdp/profile/A3D296RVX0JVKB","Helpful Votes":"0.0/0.0","Review":"I just love this little pen! J wish there were more colors. So small it will fit anywhere. Durable and simple pen operation and refills. VERY CONVENIENT!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Adeptus Astartes Mechanicus","Profile":"/gp/pdp/profile/A3EJG9CB21WJJB","Helpful Votes":"0.0/0.0","Review":"It works. No need to \"Scribble\" to get ink out, compact when capped, nicely sized when writing. Smooth and edgeless means no snagging in the pocket."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Katina","Profile":"/gp/pdp/profile/A2JOIQW1J7LTPN","Helpful Votes":"1.0/2.0","Review":"I was always breaking or loosing full sized plastic pens or even having them leak ink into my pockets. My brother had this Space pen and after using it once, I was hooked. I immediately bought myself one and haven't looked back since. It's the perfect size for a pocket pen. With the cap put on the back when writing it becomes a full sized pen so no worries about trying to write with a smaller one. There are no sharp edges (I have the version without the clip) so my pockets do not get snagged, nor does the other stuff that I carry with it all the time. And the best part - it's durable! It can keep up with me and my active life. I've had it for two years now, used it every day and it still looks close to new. Also, it's just *now* running out of ink, after two years worth of use. Best pen I ever bought! Time to go buy a refill. :-)"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Ahmed Al Obaidi","Profile":"/gp/pdp/profile/A1AN3RENZ4HAF5","Helpful Votes":"0.0/0.0","Review":"These are really comfortable to use. I plan on buying more soon. I write faster now and don't feel as tired as I do using normal pens."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Chuck Ford \"Que14kt\"","Profile":"/gp/pdp/profile/A7W94KLXY69HT","Helpful Votes":"0.0/0.0","Review":"Great pen. Note that they are small and may be too small for some people. However, if you want a good dependable pen...this is it."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Vilhjlmur","Profile":"/gp/pdp/profile/A12RANR1CS3BVB","Helpful Votes":"0.0/0.0","Review":"I love this pen. It's really small so I kept loosing it. I put some yellow electrical tape on it so it doesn't disappear as much."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Joe","Profile":"/gp/pdp/profile/AQTBJARWSJQM1","Helpful Votes":"0.0/0.0","Review":"This is my second fisher space pen and I will say that it is quality. Smooth writing and it fits easily in my pocket. Great pen."}
{"Verified Purchase":false,"Star Rating":4,"Username":"Chad Abney","Profile":"/gp/pdp/profile/A101GZ13ZUM8XA","Helpful Votes":"0.0/0.0","Review":"Handy pen that will fit in pocket or purse without taking up much room. Durable construction. Writes well for a ballpoint."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Terry Corbin","Profile":"/gp/pdp/profile/AREMIWJN2AN3E","Helpful Votes":"0.0/0.0","Review":"Excellent pen. Perfect for carrying in pants pocket without fear of leakage or breakage. Ink flow is smooth & consistent."}
{"Verified Purchase":true,"Star Rating":5,"Username":"steve Frahlich","Profile":"/gp/pdp/profile/AGUQS4YL46YUK","Helpful Votes":"0.0/0.0","Review":"These are my favorite pens ever. The only problem is they slip out of my pockets or people steal them."}
{"Verified Purchase":false,"Star Rating":5,"Username":"B. Wilding \"Brian\"","Profile":"/gp/pdp/profile/A3MDKS8B1FM6A7","Helpful Votes":"0.0/0.0","Review":"Great for a front or back pocket. Will also make it through the dryer without .... issues. (don't ask)"}
{"Verified Purchase":true,"Star Rating":5,"Username":"liuyi","Profile":"/gp/pdp/profile/A1QX3FJ0V9CN75","Helpful Votes":"0.0/0.0","Review":"Very good product. Rest assured. Quality is no problem. Fair prices. Cost-effective. Recommended."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Will Dunford","Profile":"/gp/pdp/profile/A280QI0RVJA3F5","Helpful Votes":"0.0/0.0","Review":"One of my all time favorite things. Get the fine ball ink refills though, the medium is too wide."}
{"Verified Purchase":true,"Star Rating":4,"Username":"chueymota \"chueymota52\"","Profile":"/gp/pdp/profile/A2LNZEWGV97QRC","Helpful Votes":"0.0/0.0","Review":"Great pen. I have had at least one on hand while serving in the Army and working over seas."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Bjairmi","Profile":"/gp/pdp/profile/A2J0GWC5UR47TA","Helpful Votes":"0.0/0.0","Review":"I loved the pen, but it would got the 5th star only if it was not PAINTED with matte black."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Smcress316","Profile":"/gp/pdp/profile/A3D73WIOLCNQ2R","Helpful Votes":"0.0/0.0","Review":"Cool pen, compact but feels like a full sized pen when you use it. Would recommend."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Nomad","Profile":"/gp/pdp/profile/A130TQJCCDE6PM","Helpful Votes":"0.0/0.0","Review":"Second best pen ever. I take it everywhere. and you can get several colors for it."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Jea K. Lee \"Magician Jay\"","Profile":"/gp/pdp/profile/A25RF01Z30JEKU","Helpful Votes":"0.0/0.0","Review":"It was little bit heavy than I thought but it's a great gift for my friend."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Mom of 7 from NYC","Profile":"/gp/pdp/profile/A3OKLHUAEK6E37","Helpful Votes":"0.0/0.0","Review":"Bought it as a birthday present for my 17 yr old son and he is thrilled"}
{"Verified Purchase":true,"Star Rating":2,"Username":"Redmoon","Profile":"/gp/pdp/profile/A2KZIKIFKHCJK1","Helpful Votes":"1.0/2.0","Review":"I bought this pen on a whim. Granted I may not have read the product details well enough but this pen TINY!!!! Capped about 3inches. I expected the ink to lay down smooth, given the nature of the cartrige being 'pressurized'. It fades in at first. Not good. Feels thinner than a pencil in hand. Im sure it has a place, but not impressed. 2 starrs****"}
{"Verified Purchase":true,"Star Rating":1,"Username":"Timothy A Davies","Profile":"/gp/pdp/profile/A12W5LDLNEO65I","Helpful Votes":"0.0/0.0","Review":"Ink leaks. I will stick to pens that require gravity from now on..."}
{"Verified Purchase":true,"Star Rating":1,"Username":"Vladlen","Profile":"/gp/pdp/profile/A1UY2ZJWQDBT10","Helpful Votes":"1.0/2.0","Review":"May be it can be used in space , unedr water e.t.c. but useless in real life - my 3 USD pen writs better, more smooth and on much more surfaces than Fisher. Nevertheless it looks and feels good in touch. Nice gift, bad instrument."}
{"Verified Purchase":true,"Star Rating":3,"Username":"N. Lam \"average joe\"","Profile":"/gp/pdp/profile/A3IN10XCIHKOQD","Helpful Votes":"1.0/2.0","Review":"Surprisingly, it really doesn't write that great. I'm sure it is as tough as it says, but when it comes to the simple pleasure of writing it falls short of many much cheaper options. I find myself reaching for and carrying my \"Pilot EasyTouch FINE\" instead of my space pen. The space pen is small, lightweight and sturdy, but does not write very smoothly and does not handle shallow writing angles well due to its bulbous ballpoint. Also, I have not found the need to write underwater or in an oven or freezer or in outer space. Do yourself a favor and buy the Pilot EasyTouch. It sounds like I work for Pilot, but I assure you I don't :)"}
{"Verified Purchase":true,"Star Rating":3,"Username":"SLee","Profile":"/gp/pdp/profile/A3ZC66CSUDASG","Helpful Votes":"1.0/2.0","Review":"I am very pleased with the size, shape and coating of my Space Pen. However, it must be noted that the metal ends are not very tough as mine already has a couple of dents from normal usage and fiddling (tapping on table for example, but not from dropping)."}
{"Verified Purchase":true,"Star Rating":3,"Username":"rampageous_cuss","Profile":"/gp/pdp/profile/ASW22V6LI995Z","Helpful Votes":"1.0/2.0","Review":"When I saw the words \"gift boxed\" in the product description, I was expecting the item to be gift boxed - it isn't. It comes in a clear plastic shell within a cardboard sleeve that has the product description on it - looks like a novelty item you'd find in a dime store. The pen itself is ok, but it's VERY small - far smaller than the current picture here: capped, it's about 3 1/2 inches - a little longer than my middle finger but not of course as thick. All in all it's nothing you'd want to give anyone as a main gift, but is a good size for a stocking-stuffer at Christmas."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Sarvananda Bluestone \"sarvananda\"","Profile":"/gp/pdp/profile/A3KPJCFY9OYKOK","Helpful Votes":"1.0/2.0","Review":"Fisher is the ONLY ball point pen that I use. I am an author and write my manuscripts with fountain pens. HOWEVER, for any and every other use I have, Fisher is the pen that I use. There simply is no comparison with any other ball point. It doesn't smudge. The refill seems to last forever. And, the pen goes together in a neat bullet shape (hence its name) that fits easily in my back pocket. If you want a clip pen, get something else. That's not the essence of the bullet. Oh, by the way, the pen is guaranteed for life. You just can't go wrong with this pen. I also have several stylus sized Fisher pens that I use on my desk, for bills, etc. They are all wonderful and, if you are interested in writing upside down or under water, something I rarely do, the pen has a pressurized cartridge. That's one of the reason it just about never skips or blots."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Etai Ronen","Profile":"/gp/pdp/profile/AUPKHYWJ8O9BI","Helpful Votes":"1.0/2.0","Review":"EXCELLENT PRODUCT WE ARE SO HAPPY WITH IT IT IS BEAUTIFUL AND VERY WELL MADE THE QUALITY OF THIS PRODUCT IS EXCELLENT. HOPE THIS HELP."}
{"Verified Purchase":true,"Star Rating":5,"Username":"William B. Durning \"bigdog1865\"","Profile":"/gp/pdp/profile/A6FO98SEUMUB2","Helpful Votes":"0.0/0.0","Review":"love this pen, compact and fits in my pocket...writes on anything"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Robert T. Nutting","Profile":"/gp/pdp/profile/A3IF53E1L4V669","Helpful Votes":"0.0/0.0","Review":"This pen writes smoothly and is easy to carry in your pocket."}
{"Verified Purchase":true,"Star Rating":5,"Username":"James M. Garcia","Profile":"/gp/pdp/profile/A2K5XSG6HIGFEJ","Helpful Votes":"0.0/0.0","Review":"love these pens. Carried them for 10 + years always worked."}
{"Verified Purchase":true,"Star Rating":5,"Username":"w. a. shain","Profile":"/gp/pdp/profile/A28W7SXLBF6RI5","Helpful Votes":"0.0/0.0","Review":"For me I lovr space pems. Will write rain or shine."}
{"Verified Purchase":true,"Star Rating":5,"Username":"BinhDo","Profile":"/gp/pdp/profile/A3UP7G992D2XG","Helpful Votes":"0.0/0.0","Review":"Very sleek,simple and comfortable to use."}
{"Verified Purchase":true,"Star Rating":4,"Username":"Mike C","Profile":"/gp/pdp/profile/AO1RFTSTSZ0H","Helpful Votes":"0.0/0.0","Review":"Very good product.Would like it slight"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Tamara Gutierrez","Profile":"/gp/pdp/profile/AX91TFJHJ4HI9","Helpful Votes":"0.0/0.0","Review":"I am obsessed with this pen!"}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jennifer Kyrnin","Profile":"/gp/pdp/profile/AM6L2GVG4TMNJ","Helpful Votes":"0.0/0.0","Review":"Very pretty. And a great pen"}
{"Verified Purchase":false,"Star Rating":5,"Username":"Shannon Brown Nestlerode","Profile":"/gp/pdp/profile/A1T3YPOSFTAKE6","Helpful Votes":"0.0/0.0","Review":"The russians used a pencil."}
{"Verified Purchase":false,"Star Rating":5,"Username":"Andrew Luetgers \"The Dude Abides\"","Profile":"/gp/pdp/profile/A3FREB6SDY6BLN","Helpful Votes":"3.0/6.0","Review":"To me this pen exemplifies the minimalist and clean design of the iPod, it is widely considered one of the greatest examples of modern industrial design and has a permanent home in the collections of the Museum of Modern Art. I love this pen so much I end up telling everyone I know about it. Yes that sounds stupid but there are so many reasons why it is so great. It is more fine art than pen, more crafted than manufactured, more perfect device than office supply. For one it is flippin in-de-struct-a-ble, for another the ink will NEVER LEAK. There are just so many ways that this pen feels like a finely crafted instrument, no a weapon, yes It's like holding a finely crafted hand gun. Like James Bond's Walther PPK you can feel the weight of the pen in your hand, not just your fingers, yet the impression is not of a heavy writing instrument but of balanced and solidly constructed device. The black matte is the best finish because your fingers will not stick to it like they would to a shiny surface. Here, now is an oft repeated daily moment of Zen for me. I reach into my pocket and pull out my trusty, smoooth, black matte, bullet space pen with optional clip and with both hands slowly separate the two perfectly merged halves of the pen. The pen is sealed with a high quality rubber O-ring that causes this act to have a sense of substance to it. The seal is so perfect that you can feel the smooth drag of the pen's inner wall against the rubber seal. Next I effortlessly flip the writing end of the two pieces around in my fingers and merge the round end back into the cover. This process feels more like you're tightening a special fastener, you feel the cap lock into place in a smooth yet tight envelopment of its other half. At once I begin signing my name the act is so effortless because no one ever has to think about their signature. I only focus on the act of drawing the ball point so swiftly across the receipt. Now I reverse the process just illustrated, smoothly unfastening the cap, rotating the writing end in my fingers and collapsing the instrument back into itself. In this final step again the rubber O-ring plays a role in heightening the Zen like element of this moment. As I close the instrument it feels extremely smooth and tight yet there is no resistance and as the cap slides over the pen you can feel the trapped air inside compress and once it is completely closed even a virgin would now know what perfection feels like. All this takes place in just a few seconds but the heightened awareness of the perfection of it all makes time stand almost completely still for just a second."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Lawrence Hormozian","Profile":"/gp/pdp/profile/A328OQTTENYFKU","Helpful Votes":"0.0/0.0","Review":"works great"}
{"Verified Purchase":true,"Star Rating":3,"Username":"John Gaudio","Profile":"/gp/pdp/profile/APQYM37ZDZPD6","Helpful Votes":"0.0/0.0","Review":"was a gift"}
{"Verified Purchase":true,"Star Rating":3,"Username":"Zachary Blanchard","Profile":"/gp/pdp/profile/A25P9ALE2837PW","Helpful Votes":"0.0/1.0","Review":"This pen was very expensive and didn't write very well. The ink didn't flow and is quite heavy. Also doesn't have a pocket clip. It was alright but I think it's a little expensive for what your getting. One ink refill is $6 plus $5 S&H from Fisher Space Pen."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Jovan Groen","Profile":"/gp/pdp/profile/AA2VDYJOIP48X","Helpful Votes":"0.0/1.0","Review":"On time, as described with great communication along the way. Why do we really need to have a word limit for these descriptions..."}
{"Verified Purchase":true,"Star Rating":5,"Username":"pt","Profile":"/gp/pdp/profile/AP9U0XTNGOIR2","Helpful Votes":"0.0/1.0","Review":"Awesome pen writes smoothly in very small pen. The first pen i ordered seem to have walked out on me at work, I don't know if it got tired ofme or wanted to be with someone else. So i ordered another one since the first one left. I recommend this who works in a industrial work area or an area where theres oil. Still works when theres oil on paper"}
{"Verified Purchase":true,"Star Rating":5,"Username":"M. Warshauer","Profile":"/gp/pdp/profile/A17N6JBYBLDYBL","Helpful Votes":"0.0/1.0","Review":"The only pocket pen to own. You just open the package test it and place it in your pocket. It's that simple."}
{"Verified Purchase":true,"Star Rating":5,"Username":"James R Gaylord Jr","Profile":"/gp/pdp/profile/AANE9GGAVWL8Z","Helpful Votes":"0.0/1.0","Review":"Great little pen. Writes well, easy to carry. This is my second one, had my first over ten years, only replaced it because over the years it got dinged and dented from being dropped. Looks much more expensive than it was."}
{"Verified Purchase":true,"Star Rating":4,"Username":"max do nascimento cavichini","Profile":"/gp/pdp/profile/A32D0J8UZO6JX8","Helpful Votes":"0.0/1.0","Review":"excellent product, recommend, do not need to buy suspicious, worth what you pay, and the price is very reasonable too near."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Myqlj","Profile":"/gp/pdp/profile/A23CLLX7DECKAK","Helpful Votes":"0.0/1.0","Review":"This purchase is not what I expected. I have used these pens for a decade, and loved their looks, size, ruggedness and convenience. This new style looks to be just as good looking and rugged, but lacks a pocket clip(apparently now an extra cost item). It is also is about 1/2\" longer than the previous version. I'm guessing the extra length allows for space between the tip of the cartridge and the end of the pen, preventing the occasional overflow."}
{"Verified Purchase":true,"Star Rating":4,"Username":"robby","Profile":"/gp/pdp/profile/A1PT9UOQ50V4OP","Helpful Votes":"0.0/1.0","Review":"but not as good as the old silver bullet I used to have. That one felt solid. This feels a bit weeker."}
{"Verified Purchase":true,"Star Rating":5,"Username":"V. CHAMBERLAIN \"worldbetween\"","Profile":"/gp/pdp/profile/A3VAR7SDLA6DLH","Helpful Votes":"2.0/4.0","Review":"This is the best pocket pen I've owned. It always works, no priming. Writes on just about anything. I going to but one with a clip for my shirt pocket."}
{"Verified Purchase":true,"Star Rating":3,"Username":"D. Higbee","Profile":"/gp/pdp/profile/A18O0L6RA62FT7","Helpful Votes":"5.0/9.0","Review":"This pen writes wonderfully. My frustration with the pen is related to the lack of a clip - if you set the pen down, it rolls. I've dropped the pen many times because of this. It's my own fault for not ordering the identical pen, but with the clip."}
{"Verified Purchase":true,"Star Rating":2,"Username":"A. G. Wilson","Profile":"/gp/pdp/profile/A201U9GZQDL9JU","Helpful Votes":"0.0/1.0","Review":"It writes well and is easy to carry... but it looks terrible at this point just from normal use. I would pass it out to let someone else write with. It looks embarrassing. I may get a plastic one that won't scratch/tarnish."}
{"Verified Purchase":true,"Star Rating":5,"Username":"Garold Lessig","Profile":"/gp/pdp/profile/A34NBKIIJBEI5H","Helpful Votes":"0.0/0.0","Review":"great"}
{"Verified Purchase":true,"Star Rating":2,"Username":"not so happy customer","Profile":"/gp/pdp/profile/A1TMH7JWRYB8W5","Helpful Votes":"0.0/1.0","Review":"Pen itself is well build, but the ink doesn't last long. I used it only three times and it run out of the juice."}
{"Verified Purchase":true,"Star Rating":3,"Username":"T. Brophy","Profile":"/gp/pdp/profile/A1XZIW6UVCKGN7","Helpful Votes":"1.0/3.0","Review":"I've carried a chrome FSP with me for years, and recently I decided to treat myself to the black titanium nitride version. It was a near match to the construction of the chrome, and I was pleased with my purchase. Unfortunately, I managed to lose it within a few months. I decided to order the matte black version, thinking that I might actually enjoy it more than the titanium nitride, as it would match nicely with my Moleskin notebooks. Unfortunately, the matte black pen is not the same construction as my last two FSPs. Both the chrome and TN pens have a ribbed barrel under the cap, which gives a good grip on the pen. Also the matte material adds a certain amount of thickness to the walls of the barrel, which does have the benefit of making the pen 'rattle' less when closed, but seems somehow less elegant. I'm sure it's a decent pen, considering that it uses the same ink cartridges. I'm just disappointed that the construction is different from other models."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Bryant","Profile":"/gp/pdp/profile/A378FRFKEDASJZ","Helpful Votes":"0.0/1.0","Review":"3 because if you forget it in the dryer after 5mins you cannot get the cap off."}
{"Verified Purchase":false,"Star Rating":2,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A33YMTWRDJQ29I","Helpful Votes":"8.0/15.0","Review":"When I firt purchased this pen several years ago, I thought it was decent/good. Yes it will write upsidedown, sideways, probably in water, etc. However, the flow of the ink really isn't all that good. It has never produced a nice clean line of ink...it's almost scratchy. It is also a bit on the small side. If you have larger hands you probably wouldn't care for it all that much. It is rather short and slim. I can live with all that. What I've really begun to hate is the design. The outer cover of the pen is designed in 3 parts. There is the protective cover for the point, and a 2 piece protective cover made into roughly equal lenghts (about 2 inches each) separated by a black rubber gasket. The design flaw lies with the lower (towards the pen tip) protective cover. When you hold the pen your index finger will put a slight pressure downwards (this should be obvious) on the lower cover. The other end of the pen will usually sit by your right knuckle or close to it. This slight amount of resistance against your knuckle/hand actually pushes that lower protective piece off! It's gotten to the point where I can't write more than about a minute or so where the front cover doesn't pop off. Most pens that front protective cover is threaded on. With this pen it is not. You just push it on- the diameter is slightly less than the diameter of the inner part of the pen. That slight difference is supposed to provide enough friction to keep the pen together. It did at first....now it's nothing but a headache."}
{"Verified Purchase":false,"Star Rating":1,"Username":"Thors-Hammer","Profile":"/gp/pdp/profile/ATKJ0OZCC14HL","Helpful Votes":"9.0/17.0","Review":"If you like a nice pen, buy a nice pen. If you need something cheap that you don't mind breaking, buy a cheap pen set in bulk. The space pen is not a nice pen, nor is it cheap. I used mine for military training and it failed me in days. Sand prevented the pen from opening correctly, also the ink would not set on my \"rite in rain\" pad. Now you might say \"it's meant for space, not for water\". Well, that maybe true; but for 15$ and the millions of dollars spent in R&D: it should work in more situations than #2 pencil. Also, not to dig too hard at the previous reviews; but they're focusing on the wrong aspects of this pen. It's supposed to be able to do more than \"look good in my shirt pocket\"...it's a SPACE PEN."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Santiago A Garcia","Profile":"/gp/pdp/profile/A3JGD4RJ56YZJF","Helpful Votes":"0.0/3.0","Review":"it didnot come with the clip on for the shirt pocket, i had ordered one before from some other store and it had it so now i have to contact the store and http://www.amazon.com/gp/product/B0014KVJ7S/ref=cm_cr_rev_prod_imgask them to send it to me... or i will return it..."}
{"Verified Purchase":true,"Star Rating":1,"Username":"Jim Shorts","Profile":"/gp/pdp/profile/AA9PPYMDF4M4Q","Helpful Votes":"3.0/12.0","Review":"This pen sucks. I cant believe anyone would think this is a good pen. The design is very nice, very nice to hold, writes upside down (i think most pens do). However, The pens tip crap, its messy, ink globs up on the tip, the ink smears, after writing a few lines I hand ink all over my hands and it was smeared all over the paper. Much better off with a bic."}
{"Verified Purchase":true,"Star Rating":3,"Username":"Kristen Hatfield \"kmhat\"","Profile":"/gp/pdp/profile/A3QQ281WBHXDEQ","Helpful Votes":"0.0/10.0","Review":"It's a nice pen, but I returned it because it wasn't what I was looking for. I didn't write with it, but it looked nice."}
{"Verified Purchase":false,"Star Rating":1,"Username":"Amazon Customer","Profile":"/gp/pdp/profile/A3K53DT7HNM78D","Helpful Votes":"5.0/28.0","Review":"after a couple of note taking sessions the pen has disappointed me by not working. the pen is badly designed. why would someone design a pen without a cap that attaches to the bottom? or at least a penclip? even if this pen actually worked after a couple of uses, i'm certan it would end up lost since there is no penclip, and the cap only attaches to the point end of the pen. the price is about the same price as 20 packets of bic disposable pens. for that differential, you may as well put up with the inconvenience of a pen that doesn't write vertically and that has a moderate to long lifetime. this is proof that 100 good reviews on a product does not automatically make it a good purchase."}
